/* automatically generated by rust-bindgen 0.72.1 */

pub const PLATFORM: &[u8; 6] = b"mswin\0";
pub const PLATFORM_SPC: &[u8; 6] = b"win32\0";
pub const MAX_ENT_LEAFS: u32 = 48;
pub const ENGINE_INTERFACE_VERSION: u32 = 138;
pub const INTERFACE_VERSION: u32 = 140;
pub const MSG_BROADCAST: u32 = 0;
pub const MSG_ONE: u32 = 1;
pub const MSG_ALL: u32 = 2;
pub const MSG_INIT: u32 = 3;
pub const MSG_PVS: u32 = 4;
pub const MSG_PAS: u32 = 5;
pub const MSG_PVS_R: u32 = 6;
pub const MSG_PAS_R: u32 = 7;
pub const MSG_ONE_UNRELIABLE: u32 = 8;
pub const MSG_SPEC: u32 = 9;
pub const MAX_LEVEL_CONNECTIONS: u32 = 16;
pub const MAX_QPATH: u32 = 64;
pub type qboolean = ::std::os::raw::c_int;
pub type uint8 = ::std::os::raw::c_uchar;
pub type int8 = ::std::os::raw::c_schar;
pub type int16 = ::std::os::raw::c_short;
pub type uint16 = ::std::os::raw::c_ushort;
pub type int32 = ::std::os::raw::c_int;
pub type uint32 = ::std::os::raw::c_uint;
pub type int64 = ::std::os::raw::c_longlong;
pub type uint64 = ::std::os::raw::c_ulonglong;
pub type intp = ::std::os::raw::c_int;
pub type uintp = ::std::os::raw::c_uint;
pub type CRC32_t = uint32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct link_s {
    pub prev: *mut link_s,
    pub next: *mut link_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of link_s"][::std::mem::size_of::<link_s>() - 8usize];
    ["Alignment of link_s"][::std::mem::align_of::<link_s>() - 4usize];
    ["Offset of field: link_s::prev"][::std::mem::offset_of!(link_s, prev) - 0usize];
    ["Offset of field: link_s::next"][::std::mem::offset_of!(link_s, next) - 4usize];
};
pub type link_t = link_s;
pub type edict_t = edict_s;
pub type func_t = ::std::os::raw::c_uint;
pub type string_t = ::std::os::raw::c_uint;
pub type vec_t = f32;
pub type byte = ::std::os::raw::c_uchar;
pub type word = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vector2D {
    pub x: vec_t,
    pub y: vec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector2D"][::std::mem::size_of::<Vector2D>() - 8usize];
    ["Alignment of Vector2D"][::std::mem::align_of::<Vector2D>() - 4usize];
    ["Offset of field: Vector2D::x"][::std::mem::offset_of!(Vector2D, x) - 0usize];
    ["Offset of field: Vector2D::y"][::std::mem::offset_of!(Vector2D, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vector {
    pub x: vec_t,
    pub y: vec_t,
    pub z: vec_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector"][::std::mem::size_of::<Vector>() - 12usize];
    ["Alignment of Vector"][::std::mem::align_of::<Vector>() - 4usize];
    ["Offset of field: Vector::x"][::std::mem::offset_of!(Vector, x) - 0usize];
    ["Offset of field: Vector::y"][::std::mem::offset_of!(Vector, y) - 4usize];
    ["Offset of field: Vector::z"][::std::mem::offset_of!(Vector, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct globalvars_t {
    pub time: f32,
    pub frametime: f32,
    pub force_retouch: f32,
    pub mapname: string_t,
    pub startspot: string_t,
    pub deathmatch: f32,
    pub coop: f32,
    pub teamplay: f32,
    pub serverflags: f32,
    pub found_secrets: f32,
    pub v_forward: Vector,
    pub v_up: Vector,
    pub v_right: Vector,
    pub trace_allsolid: f32,
    pub trace_startsolid: f32,
    pub trace_fraction: f32,
    pub trace_endpos: Vector,
    pub trace_plane_normal: Vector,
    pub trace_plane_dist: f32,
    pub trace_ent: *mut edict_t,
    pub trace_inopen: f32,
    pub trace_inwater: f32,
    pub trace_hitgroup: ::std::os::raw::c_int,
    pub trace_flags: ::std::os::raw::c_int,
    pub msg_entity: ::std::os::raw::c_int,
    pub cdAudioTrack: ::std::os::raw::c_int,
    pub maxClients: ::std::os::raw::c_int,
    pub maxEntities: ::std::os::raw::c_int,
    pub pStringBase: *const ::std::os::raw::c_char,
    pub pSaveData: *mut ::std::os::raw::c_void,
    pub vecLandmarkOffset: Vector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of globalvars_t"][::std::mem::size_of::<globalvars_t>() - 172usize];
    ["Alignment of globalvars_t"][::std::mem::align_of::<globalvars_t>() - 4usize];
    ["Offset of field: globalvars_t::time"][::std::mem::offset_of!(globalvars_t, time) - 0usize];
    ["Offset of field: globalvars_t::frametime"]
        [::std::mem::offset_of!(globalvars_t, frametime) - 4usize];
    ["Offset of field: globalvars_t::force_retouch"]
        [::std::mem::offset_of!(globalvars_t, force_retouch) - 8usize];
    ["Offset of field: globalvars_t::mapname"]
        [::std::mem::offset_of!(globalvars_t, mapname) - 12usize];
    ["Offset of field: globalvars_t::startspot"]
        [::std::mem::offset_of!(globalvars_t, startspot) - 16usize];
    ["Offset of field: globalvars_t::deathmatch"]
        [::std::mem::offset_of!(globalvars_t, deathmatch) - 20usize];
    ["Offset of field: globalvars_t::coop"][::std::mem::offset_of!(globalvars_t, coop) - 24usize];
    ["Offset of field: globalvars_t::teamplay"]
        [::std::mem::offset_of!(globalvars_t, teamplay) - 28usize];
    ["Offset of field: globalvars_t::serverflags"]
        [::std::mem::offset_of!(globalvars_t, serverflags) - 32usize];
    ["Offset of field: globalvars_t::found_secrets"]
        [::std::mem::offset_of!(globalvars_t, found_secrets) - 36usize];
    ["Offset of field: globalvars_t::v_forward"]
        [::std::mem::offset_of!(globalvars_t, v_forward) - 40usize];
    ["Offset of field: globalvars_t::v_up"][::std::mem::offset_of!(globalvars_t, v_up) - 52usize];
    ["Offset of field: globalvars_t::v_right"]
        [::std::mem::offset_of!(globalvars_t, v_right) - 64usize];
    ["Offset of field: globalvars_t::trace_allsolid"]
        [::std::mem::offset_of!(globalvars_t, trace_allsolid) - 76usize];
    ["Offset of field: globalvars_t::trace_startsolid"]
        [::std::mem::offset_of!(globalvars_t, trace_startsolid) - 80usize];
    ["Offset of field: globalvars_t::trace_fraction"]
        [::std::mem::offset_of!(globalvars_t, trace_fraction) - 84usize];
    ["Offset of field: globalvars_t::trace_endpos"]
        [::std::mem::offset_of!(globalvars_t, trace_endpos) - 88usize];
    ["Offset of field: globalvars_t::trace_plane_normal"]
        [::std::mem::offset_of!(globalvars_t, trace_plane_normal) - 100usize];
    ["Offset of field: globalvars_t::trace_plane_dist"]
        [::std::mem::offset_of!(globalvars_t, trace_plane_dist) - 112usize];
    ["Offset of field: globalvars_t::trace_ent"]
        [::std::mem::offset_of!(globalvars_t, trace_ent) - 116usize];
    ["Offset of field: globalvars_t::trace_inopen"]
        [::std::mem::offset_of!(globalvars_t, trace_inopen) - 120usize];
    ["Offset of field: globalvars_t::trace_inwater"]
        [::std::mem::offset_of!(globalvars_t, trace_inwater) - 124usize];
    ["Offset of field: globalvars_t::trace_hitgroup"]
        [::std::mem::offset_of!(globalvars_t, trace_hitgroup) - 128usize];
    ["Offset of field: globalvars_t::trace_flags"]
        [::std::mem::offset_of!(globalvars_t, trace_flags) - 132usize];
    ["Offset of field: globalvars_t::msg_entity"]
        [::std::mem::offset_of!(globalvars_t, msg_entity) - 136usize];
    ["Offset of field: globalvars_t::cdAudioTrack"]
        [::std::mem::offset_of!(globalvars_t, cdAudioTrack) - 140usize];
    ["Offset of field: globalvars_t::maxClients"]
        [::std::mem::offset_of!(globalvars_t, maxClients) - 144usize];
    ["Offset of field: globalvars_t::maxEntities"]
        [::std::mem::offset_of!(globalvars_t, maxEntities) - 148usize];
    ["Offset of field: globalvars_t::pStringBase"]
        [::std::mem::offset_of!(globalvars_t, pStringBase) - 152usize];
    ["Offset of field: globalvars_t::pSaveData"]
        [::std::mem::offset_of!(globalvars_t, pSaveData) - 156usize];
    ["Offset of field: globalvars_t::vecLandmarkOffset"]
        [::std::mem::offset_of!(globalvars_t, vecLandmarkOffset) - 160usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct entvars_s {
    pub classname: string_t,
    pub globalname: string_t,
    pub origin: Vector,
    pub oldorigin: Vector,
    pub velocity: Vector,
    pub basevelocity: Vector,
    pub clbasevelocity: Vector,
    pub movedir: Vector,
    pub angles: Vector,
    pub avelocity: Vector,
    pub punchangle: Vector,
    pub v_angle: Vector,
    pub endpos: Vector,
    pub startpos: Vector,
    pub impacttime: f32,
    pub starttime: f32,
    pub fixangle: ::std::os::raw::c_int,
    pub idealpitch: f32,
    pub pitch_speed: f32,
    pub ideal_yaw: f32,
    pub yaw_speed: f32,
    pub modelindex: ::std::os::raw::c_int,
    pub model: string_t,
    pub viewmodel: ::std::os::raw::c_int,
    pub weaponmodel: ::std::os::raw::c_int,
    pub absmin: Vector,
    pub absmax: Vector,
    pub mins: Vector,
    pub maxs: Vector,
    pub size: Vector,
    pub ltime: f32,
    pub nextthink: f32,
    pub movetype: ::std::os::raw::c_int,
    pub solid: ::std::os::raw::c_int,
    pub skin: ::std::os::raw::c_int,
    pub body: ::std::os::raw::c_int,
    pub effects: ::std::os::raw::c_int,
    pub gravity: f32,
    pub friction: f32,
    pub light_level: ::std::os::raw::c_int,
    pub sequence: ::std::os::raw::c_int,
    pub gaitsequence: ::std::os::raw::c_int,
    pub frame: f32,
    pub animtime: f32,
    pub framerate: f32,
    pub controller: [byte; 4usize],
    pub blending: [byte; 2usize],
    pub scale: f32,
    pub rendermode: ::std::os::raw::c_int,
    pub renderamt: f32,
    pub rendercolor: Vector,
    pub renderfx: ::std::os::raw::c_int,
    pub health: f32,
    pub frags: f32,
    pub weapons: ::std::os::raw::c_int,
    pub takedamage: f32,
    pub deadflag: ::std::os::raw::c_int,
    pub view_ofs: Vector,
    pub button: ::std::os::raw::c_int,
    pub impulse: ::std::os::raw::c_int,
    pub chain: *mut edict_t,
    pub dmg_inflictor: *mut edict_t,
    pub enemy: *mut edict_t,
    pub aiment: *mut edict_t,
    pub owner: *mut edict_t,
    pub groundentity: *mut edict_t,
    pub spawnflags: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub colormap: ::std::os::raw::c_int,
    pub team: ::std::os::raw::c_int,
    pub max_health: f32,
    pub teleport_time: f32,
    pub armortype: f32,
    pub armorvalue: f32,
    pub waterlevel: ::std::os::raw::c_int,
    pub watertype: ::std::os::raw::c_int,
    pub target: string_t,
    pub targetname: string_t,
    pub netname: string_t,
    pub message: string_t,
    pub dmg_take: f32,
    pub dmg_save: f32,
    pub dmg: f32,
    pub dmgtime: f32,
    pub noise: string_t,
    pub noise1: string_t,
    pub noise2: string_t,
    pub noise3: string_t,
    pub speed: f32,
    pub air_finished: f32,
    pub pain_finished: f32,
    pub radsuit_finished: f32,
    pub pContainingEntity: *mut edict_t,
    pub playerclass: ::std::os::raw::c_int,
    pub maxspeed: f32,
    pub fov: f32,
    pub weaponanim: ::std::os::raw::c_int,
    pub pushmsec: ::std::os::raw::c_int,
    pub bInDuck: ::std::os::raw::c_int,
    pub flTimeStepSound: ::std::os::raw::c_int,
    pub flSwimTime: ::std::os::raw::c_int,
    pub flDuckTime: ::std::os::raw::c_int,
    pub iStepLeft: ::std::os::raw::c_int,
    pub flFallVelocity: f32,
    pub gamestate: ::std::os::raw::c_int,
    pub oldbuttons: ::std::os::raw::c_int,
    pub groupinfo: ::std::os::raw::c_int,
    pub iuser1: ::std::os::raw::c_int,
    pub iuser2: ::std::os::raw::c_int,
    pub iuser3: ::std::os::raw::c_int,
    pub iuser4: ::std::os::raw::c_int,
    pub fuser1: f32,
    pub fuser2: f32,
    pub fuser3: f32,
    pub fuser4: f32,
    pub vuser1: Vector,
    pub vuser2: Vector,
    pub vuser3: Vector,
    pub vuser4: Vector,
    pub euser1: *mut edict_t,
    pub euser2: *mut edict_t,
    pub euser3: *mut edict_t,
    pub euser4: *mut edict_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of entvars_s"][::std::mem::size_of::<entvars_s>() - 676usize];
    ["Alignment of entvars_s"][::std::mem::align_of::<entvars_s>() - 4usize];
    ["Offset of field: entvars_s::classname"]
        [::std::mem::offset_of!(entvars_s, classname) - 0usize];
    ["Offset of field: entvars_s::globalname"]
        [::std::mem::offset_of!(entvars_s, globalname) - 4usize];
    ["Offset of field: entvars_s::origin"][::std::mem::offset_of!(entvars_s, origin) - 8usize];
    ["Offset of field: entvars_s::oldorigin"]
        [::std::mem::offset_of!(entvars_s, oldorigin) - 20usize];
    ["Offset of field: entvars_s::velocity"][::std::mem::offset_of!(entvars_s, velocity) - 32usize];
    ["Offset of field: entvars_s::basevelocity"]
        [::std::mem::offset_of!(entvars_s, basevelocity) - 44usize];
    ["Offset of field: entvars_s::clbasevelocity"]
        [::std::mem::offset_of!(entvars_s, clbasevelocity) - 56usize];
    ["Offset of field: entvars_s::movedir"][::std::mem::offset_of!(entvars_s, movedir) - 68usize];
    ["Offset of field: entvars_s::angles"][::std::mem::offset_of!(entvars_s, angles) - 80usize];
    ["Offset of field: entvars_s::avelocity"]
        [::std::mem::offset_of!(entvars_s, avelocity) - 92usize];
    ["Offset of field: entvars_s::punchangle"]
        [::std::mem::offset_of!(entvars_s, punchangle) - 104usize];
    ["Offset of field: entvars_s::v_angle"][::std::mem::offset_of!(entvars_s, v_angle) - 116usize];
    ["Offset of field: entvars_s::endpos"][::std::mem::offset_of!(entvars_s, endpos) - 128usize];
    ["Offset of field: entvars_s::startpos"]
        [::std::mem::offset_of!(entvars_s, startpos) - 140usize];
    ["Offset of field: entvars_s::impacttime"]
        [::std::mem::offset_of!(entvars_s, impacttime) - 152usize];
    ["Offset of field: entvars_s::starttime"]
        [::std::mem::offset_of!(entvars_s, starttime) - 156usize];
    ["Offset of field: entvars_s::fixangle"]
        [::std::mem::offset_of!(entvars_s, fixangle) - 160usize];
    ["Offset of field: entvars_s::idealpitch"]
        [::std::mem::offset_of!(entvars_s, idealpitch) - 164usize];
    ["Offset of field: entvars_s::pitch_speed"]
        [::std::mem::offset_of!(entvars_s, pitch_speed) - 168usize];
    ["Offset of field: entvars_s::ideal_yaw"]
        [::std::mem::offset_of!(entvars_s, ideal_yaw) - 172usize];
    ["Offset of field: entvars_s::yaw_speed"]
        [::std::mem::offset_of!(entvars_s, yaw_speed) - 176usize];
    ["Offset of field: entvars_s::modelindex"]
        [::std::mem::offset_of!(entvars_s, modelindex) - 180usize];
    ["Offset of field: entvars_s::model"][::std::mem::offset_of!(entvars_s, model) - 184usize];
    ["Offset of field: entvars_s::viewmodel"]
        [::std::mem::offset_of!(entvars_s, viewmodel) - 188usize];
    ["Offset of field: entvars_s::weaponmodel"]
        [::std::mem::offset_of!(entvars_s, weaponmodel) - 192usize];
    ["Offset of field: entvars_s::absmin"][::std::mem::offset_of!(entvars_s, absmin) - 196usize];
    ["Offset of field: entvars_s::absmax"][::std::mem::offset_of!(entvars_s, absmax) - 208usize];
    ["Offset of field: entvars_s::mins"][::std::mem::offset_of!(entvars_s, mins) - 220usize];
    ["Offset of field: entvars_s::maxs"][::std::mem::offset_of!(entvars_s, maxs) - 232usize];
    ["Offset of field: entvars_s::size"][::std::mem::offset_of!(entvars_s, size) - 244usize];
    ["Offset of field: entvars_s::ltime"][::std::mem::offset_of!(entvars_s, ltime) - 256usize];
    ["Offset of field: entvars_s::nextthink"]
        [::std::mem::offset_of!(entvars_s, nextthink) - 260usize];
    ["Offset of field: entvars_s::movetype"]
        [::std::mem::offset_of!(entvars_s, movetype) - 264usize];
    ["Offset of field: entvars_s::solid"][::std::mem::offset_of!(entvars_s, solid) - 268usize];
    ["Offset of field: entvars_s::skin"][::std::mem::offset_of!(entvars_s, skin) - 272usize];
    ["Offset of field: entvars_s::body"][::std::mem::offset_of!(entvars_s, body) - 276usize];
    ["Offset of field: entvars_s::effects"][::std::mem::offset_of!(entvars_s, effects) - 280usize];
    ["Offset of field: entvars_s::gravity"][::std::mem::offset_of!(entvars_s, gravity) - 284usize];
    ["Offset of field: entvars_s::friction"]
        [::std::mem::offset_of!(entvars_s, friction) - 288usize];
    ["Offset of field: entvars_s::light_level"]
        [::std::mem::offset_of!(entvars_s, light_level) - 292usize];
    ["Offset of field: entvars_s::sequence"]
        [::std::mem::offset_of!(entvars_s, sequence) - 296usize];
    ["Offset of field: entvars_s::gaitsequence"]
        [::std::mem::offset_of!(entvars_s, gaitsequence) - 300usize];
    ["Offset of field: entvars_s::frame"][::std::mem::offset_of!(entvars_s, frame) - 304usize];
    ["Offset of field: entvars_s::animtime"]
        [::std::mem::offset_of!(entvars_s, animtime) - 308usize];
    ["Offset of field: entvars_s::framerate"]
        [::std::mem::offset_of!(entvars_s, framerate) - 312usize];
    ["Offset of field: entvars_s::controller"]
        [::std::mem::offset_of!(entvars_s, controller) - 316usize];
    ["Offset of field: entvars_s::blending"]
        [::std::mem::offset_of!(entvars_s, blending) - 320usize];
    ["Offset of field: entvars_s::scale"][::std::mem::offset_of!(entvars_s, scale) - 324usize];
    ["Offset of field: entvars_s::rendermode"]
        [::std::mem::offset_of!(entvars_s, rendermode) - 328usize];
    ["Offset of field: entvars_s::renderamt"]
        [::std::mem::offset_of!(entvars_s, renderamt) - 332usize];
    ["Offset of field: entvars_s::rendercolor"]
        [::std::mem::offset_of!(entvars_s, rendercolor) - 336usize];
    ["Offset of field: entvars_s::renderfx"]
        [::std::mem::offset_of!(entvars_s, renderfx) - 348usize];
    ["Offset of field: entvars_s::health"][::std::mem::offset_of!(entvars_s, health) - 352usize];
    ["Offset of field: entvars_s::frags"][::std::mem::offset_of!(entvars_s, frags) - 356usize];
    ["Offset of field: entvars_s::weapons"][::std::mem::offset_of!(entvars_s, weapons) - 360usize];
    ["Offset of field: entvars_s::takedamage"]
        [::std::mem::offset_of!(entvars_s, takedamage) - 364usize];
    ["Offset of field: entvars_s::deadflag"]
        [::std::mem::offset_of!(entvars_s, deadflag) - 368usize];
    ["Offset of field: entvars_s::view_ofs"]
        [::std::mem::offset_of!(entvars_s, view_ofs) - 372usize];
    ["Offset of field: entvars_s::button"][::std::mem::offset_of!(entvars_s, button) - 384usize];
    ["Offset of field: entvars_s::impulse"][::std::mem::offset_of!(entvars_s, impulse) - 388usize];
    ["Offset of field: entvars_s::chain"][::std::mem::offset_of!(entvars_s, chain) - 392usize];
    ["Offset of field: entvars_s::dmg_inflictor"]
        [::std::mem::offset_of!(entvars_s, dmg_inflictor) - 396usize];
    ["Offset of field: entvars_s::enemy"][::std::mem::offset_of!(entvars_s, enemy) - 400usize];
    ["Offset of field: entvars_s::aiment"][::std::mem::offset_of!(entvars_s, aiment) - 404usize];
    ["Offset of field: entvars_s::owner"][::std::mem::offset_of!(entvars_s, owner) - 408usize];
    ["Offset of field: entvars_s::groundentity"]
        [::std::mem::offset_of!(entvars_s, groundentity) - 412usize];
    ["Offset of field: entvars_s::spawnflags"]
        [::std::mem::offset_of!(entvars_s, spawnflags) - 416usize];
    ["Offset of field: entvars_s::flags"][::std::mem::offset_of!(entvars_s, flags) - 420usize];
    ["Offset of field: entvars_s::colormap"]
        [::std::mem::offset_of!(entvars_s, colormap) - 424usize];
    ["Offset of field: entvars_s::team"][::std::mem::offset_of!(entvars_s, team) - 428usize];
    ["Offset of field: entvars_s::max_health"]
        [::std::mem::offset_of!(entvars_s, max_health) - 432usize];
    ["Offset of field: entvars_s::teleport_time"]
        [::std::mem::offset_of!(entvars_s, teleport_time) - 436usize];
    ["Offset of field: entvars_s::armortype"]
        [::std::mem::offset_of!(entvars_s, armortype) - 440usize];
    ["Offset of field: entvars_s::armorvalue"]
        [::std::mem::offset_of!(entvars_s, armorvalue) - 444usize];
    ["Offset of field: entvars_s::waterlevel"]
        [::std::mem::offset_of!(entvars_s, waterlevel) - 448usize];
    ["Offset of field: entvars_s::watertype"]
        [::std::mem::offset_of!(entvars_s, watertype) - 452usize];
    ["Offset of field: entvars_s::target"][::std::mem::offset_of!(entvars_s, target) - 456usize];
    ["Offset of field: entvars_s::targetname"]
        [::std::mem::offset_of!(entvars_s, targetname) - 460usize];
    ["Offset of field: entvars_s::netname"][::std::mem::offset_of!(entvars_s, netname) - 464usize];
    ["Offset of field: entvars_s::message"][::std::mem::offset_of!(entvars_s, message) - 468usize];
    ["Offset of field: entvars_s::dmg_take"]
        [::std::mem::offset_of!(entvars_s, dmg_take) - 472usize];
    ["Offset of field: entvars_s::dmg_save"]
        [::std::mem::offset_of!(entvars_s, dmg_save) - 476usize];
    ["Offset of field: entvars_s::dmg"][::std::mem::offset_of!(entvars_s, dmg) - 480usize];
    ["Offset of field: entvars_s::dmgtime"][::std::mem::offset_of!(entvars_s, dmgtime) - 484usize];
    ["Offset of field: entvars_s::noise"][::std::mem::offset_of!(entvars_s, noise) - 488usize];
    ["Offset of field: entvars_s::noise1"][::std::mem::offset_of!(entvars_s, noise1) - 492usize];
    ["Offset of field: entvars_s::noise2"][::std::mem::offset_of!(entvars_s, noise2) - 496usize];
    ["Offset of field: entvars_s::noise3"][::std::mem::offset_of!(entvars_s, noise3) - 500usize];
    ["Offset of field: entvars_s::speed"][::std::mem::offset_of!(entvars_s, speed) - 504usize];
    ["Offset of field: entvars_s::air_finished"]
        [::std::mem::offset_of!(entvars_s, air_finished) - 508usize];
    ["Offset of field: entvars_s::pain_finished"]
        [::std::mem::offset_of!(entvars_s, pain_finished) - 512usize];
    ["Offset of field: entvars_s::radsuit_finished"]
        [::std::mem::offset_of!(entvars_s, radsuit_finished) - 516usize];
    ["Offset of field: entvars_s::pContainingEntity"]
        [::std::mem::offset_of!(entvars_s, pContainingEntity) - 520usize];
    ["Offset of field: entvars_s::playerclass"]
        [::std::mem::offset_of!(entvars_s, playerclass) - 524usize];
    ["Offset of field: entvars_s::maxspeed"]
        [::std::mem::offset_of!(entvars_s, maxspeed) - 528usize];
    ["Offset of field: entvars_s::fov"][::std::mem::offset_of!(entvars_s, fov) - 532usize];
    ["Offset of field: entvars_s::weaponanim"]
        [::std::mem::offset_of!(entvars_s, weaponanim) - 536usize];
    ["Offset of field: entvars_s::pushmsec"]
        [::std::mem::offset_of!(entvars_s, pushmsec) - 540usize];
    ["Offset of field: entvars_s::bInDuck"][::std::mem::offset_of!(entvars_s, bInDuck) - 544usize];
    ["Offset of field: entvars_s::flTimeStepSound"]
        [::std::mem::offset_of!(entvars_s, flTimeStepSound) - 548usize];
    ["Offset of field: entvars_s::flSwimTime"]
        [::std::mem::offset_of!(entvars_s, flSwimTime) - 552usize];
    ["Offset of field: entvars_s::flDuckTime"]
        [::std::mem::offset_of!(entvars_s, flDuckTime) - 556usize];
    ["Offset of field: entvars_s::iStepLeft"]
        [::std::mem::offset_of!(entvars_s, iStepLeft) - 560usize];
    ["Offset of field: entvars_s::flFallVelocity"]
        [::std::mem::offset_of!(entvars_s, flFallVelocity) - 564usize];
    ["Offset of field: entvars_s::gamestate"]
        [::std::mem::offset_of!(entvars_s, gamestate) - 568usize];
    ["Offset of field: entvars_s::oldbuttons"]
        [::std::mem::offset_of!(entvars_s, oldbuttons) - 572usize];
    ["Offset of field: entvars_s::groupinfo"]
        [::std::mem::offset_of!(entvars_s, groupinfo) - 576usize];
    ["Offset of field: entvars_s::iuser1"][::std::mem::offset_of!(entvars_s, iuser1) - 580usize];
    ["Offset of field: entvars_s::iuser2"][::std::mem::offset_of!(entvars_s, iuser2) - 584usize];
    ["Offset of field: entvars_s::iuser3"][::std::mem::offset_of!(entvars_s, iuser3) - 588usize];
    ["Offset of field: entvars_s::iuser4"][::std::mem::offset_of!(entvars_s, iuser4) - 592usize];
    ["Offset of field: entvars_s::fuser1"][::std::mem::offset_of!(entvars_s, fuser1) - 596usize];
    ["Offset of field: entvars_s::fuser2"][::std::mem::offset_of!(entvars_s, fuser2) - 600usize];
    ["Offset of field: entvars_s::fuser3"][::std::mem::offset_of!(entvars_s, fuser3) - 604usize];
    ["Offset of field: entvars_s::fuser4"][::std::mem::offset_of!(entvars_s, fuser4) - 608usize];
    ["Offset of field: entvars_s::vuser1"][::std::mem::offset_of!(entvars_s, vuser1) - 612usize];
    ["Offset of field: entvars_s::vuser2"][::std::mem::offset_of!(entvars_s, vuser2) - 624usize];
    ["Offset of field: entvars_s::vuser3"][::std::mem::offset_of!(entvars_s, vuser3) - 636usize];
    ["Offset of field: entvars_s::vuser4"][::std::mem::offset_of!(entvars_s, vuser4) - 648usize];
    ["Offset of field: entvars_s::euser1"][::std::mem::offset_of!(entvars_s, euser1) - 660usize];
    ["Offset of field: entvars_s::euser2"][::std::mem::offset_of!(entvars_s, euser2) - 664usize];
    ["Offset of field: entvars_s::euser3"][::std::mem::offset_of!(entvars_s, euser3) - 668usize];
    ["Offset of field: entvars_s::euser4"][::std::mem::offset_of!(entvars_s, euser4) - 672usize];
};
pub type entvars_t = entvars_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct edict_s {
    pub free: qboolean,
    pub serialnumber: ::std::os::raw::c_int,
    pub area: link_t,
    pub headnode: ::std::os::raw::c_int,
    pub num_leafs: ::std::os::raw::c_int,
    pub leafnums: [::std::os::raw::c_short; 48usize],
    pub freetime: f32,
    pub pvPrivateData: *mut ::std::os::raw::c_void,
    pub v: entvars_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of edict_s"][::std::mem::size_of::<edict_s>() - 804usize];
    ["Alignment of edict_s"][::std::mem::align_of::<edict_s>() - 4usize];
    ["Offset of field: edict_s::free"][::std::mem::offset_of!(edict_s, free) - 0usize];
    ["Offset of field: edict_s::serialnumber"]
        [::std::mem::offset_of!(edict_s, serialnumber) - 4usize];
    ["Offset of field: edict_s::area"][::std::mem::offset_of!(edict_s, area) - 8usize];
    ["Offset of field: edict_s::headnode"][::std::mem::offset_of!(edict_s, headnode) - 16usize];
    ["Offset of field: edict_s::num_leafs"][::std::mem::offset_of!(edict_s, num_leafs) - 20usize];
    ["Offset of field: edict_s::leafnums"][::std::mem::offset_of!(edict_s, leafnums) - 24usize];
    ["Offset of field: edict_s::freetime"][::std::mem::offset_of!(edict_s, freetime) - 120usize];
    ["Offset of field: edict_s::pvPrivateData"]
        [::std::mem::offset_of!(edict_s, pvPrivateData) - 124usize];
    ["Offset of field: edict_s::v"][::std::mem::offset_of!(edict_s, v) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TraceResult {
    pub fAllSolid: ::std::os::raw::c_int,
    pub fStartSolid: ::std::os::raw::c_int,
    pub fInOpen: ::std::os::raw::c_int,
    pub fInWater: ::std::os::raw::c_int,
    pub flFraction: f32,
    pub vecEndPos: Vector,
    pub flPlaneDist: f32,
    pub vecPlaneNormal: Vector,
    pub pHit: *mut edict_t,
    pub iHitgroup: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TraceResult"][::std::mem::size_of::<TraceResult>() - 56usize];
    ["Alignment of TraceResult"][::std::mem::align_of::<TraceResult>() - 4usize];
    ["Offset of field: TraceResult::fAllSolid"]
        [::std::mem::offset_of!(TraceResult, fAllSolid) - 0usize];
    ["Offset of field: TraceResult::fStartSolid"]
        [::std::mem::offset_of!(TraceResult, fStartSolid) - 4usize];
    ["Offset of field: TraceResult::fInOpen"]
        [::std::mem::offset_of!(TraceResult, fInOpen) - 8usize];
    ["Offset of field: TraceResult::fInWater"]
        [::std::mem::offset_of!(TraceResult, fInWater) - 12usize];
    ["Offset of field: TraceResult::flFraction"]
        [::std::mem::offset_of!(TraceResult, flFraction) - 16usize];
    ["Offset of field: TraceResult::vecEndPos"]
        [::std::mem::offset_of!(TraceResult, vecEndPos) - 20usize];
    ["Offset of field: TraceResult::flPlaneDist"]
        [::std::mem::offset_of!(TraceResult, flPlaneDist) - 32usize];
    ["Offset of field: TraceResult::vecPlaneNormal"]
        [::std::mem::offset_of!(TraceResult, vecPlaneNormal) - 36usize];
    ["Offset of field: TraceResult::pHit"][::std::mem::offset_of!(TraceResult, pHit) - 48usize];
    ["Offset of field: TraceResult::iHitgroup"]
        [::std::mem::offset_of!(TraceResult, iHitgroup) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cvar_s {
    pub name: *const ::std::os::raw::c_char,
    pub string: *const ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_int,
    pub value: f32,
    pub next: *mut cvar_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cvar_s"][::std::mem::size_of::<cvar_s>() - 20usize];
    ["Alignment of cvar_s"][::std::mem::align_of::<cvar_s>() - 4usize];
    ["Offset of field: cvar_s::name"][::std::mem::offset_of!(cvar_s, name) - 0usize];
    ["Offset of field: cvar_s::string"][::std::mem::offset_of!(cvar_s, string) - 4usize];
    ["Offset of field: cvar_s::flags"][::std::mem::offset_of!(cvar_s, flags) - 8usize];
    ["Offset of field: cvar_s::value"][::std::mem::offset_of!(cvar_s, value) - 12usize];
    ["Offset of field: cvar_s::next"][::std::mem::offset_of!(cvar_s, next) - 16usize];
};
pub type cvar_t = cvar_s;
pub const ALERT_TYPE_at_notice: ALERT_TYPE = 0;
pub const ALERT_TYPE_at_console: ALERT_TYPE = 1;
pub const ALERT_TYPE_at_aiconsole: ALERT_TYPE = 2;
pub const ALERT_TYPE_at_warning: ALERT_TYPE = 3;
pub const ALERT_TYPE_at_error: ALERT_TYPE = 4;
pub const ALERT_TYPE_at_logged: ALERT_TYPE = 5;
pub type ALERT_TYPE = ::std::os::raw::c_int;
pub const PRINT_TYPE_print_console: PRINT_TYPE = 0;
pub const PRINT_TYPE_print_center: PRINT_TYPE = 1;
pub const PRINT_TYPE_print_chat: PRINT_TYPE = 2;
pub type PRINT_TYPE = ::std::os::raw::c_int;
pub const FORCE_TYPE_force_exactfile: FORCE_TYPE = 0;
pub const FORCE_TYPE_force_model_samebounds: FORCE_TYPE = 1;
pub const FORCE_TYPE_force_model_specifybounds: FORCE_TYPE = 2;
pub const FORCE_TYPE_force_model_specifybounds_if_avail: FORCE_TYPE = 3;
pub type FORCE_TYPE = ::std::os::raw::c_int;
pub type sentenceEntry_s = sentenceEntry_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sentenceEntry_ {
    pub data: *mut ::std::os::raw::c_char,
    pub nextEntry: *mut sentenceEntry_s,
    pub isGlobal: qboolean,
    pub index: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sentenceEntry_"][::std::mem::size_of::<sentenceEntry_>() - 16usize];
    ["Alignment of sentenceEntry_"][::std::mem::align_of::<sentenceEntry_>() - 4usize];
    ["Offset of field: sentenceEntry_::data"]
        [::std::mem::offset_of!(sentenceEntry_, data) - 0usize];
    ["Offset of field: sentenceEntry_::nextEntry"]
        [::std::mem::offset_of!(sentenceEntry_, nextEntry) - 4usize];
    ["Offset of field: sentenceEntry_::isGlobal"]
        [::std::mem::offset_of!(sentenceEntry_, isGlobal) - 8usize];
    ["Offset of field: sentenceEntry_::index"]
        [::std::mem::offset_of!(sentenceEntry_, index) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct client_textmessage_s {
    pub effect: ::std::os::raw::c_int,
    pub r1: byte,
    pub g1: byte,
    pub b1: byte,
    pub a1: byte,
    pub r2: byte,
    pub g2: byte,
    pub b2: byte,
    pub a2: byte,
    pub x: f32,
    pub y: f32,
    pub fadein: f32,
    pub fadeout: f32,
    pub holdtime: f32,
    pub fxtime: f32,
    pub pName: *const ::std::os::raw::c_char,
    pub pMessage: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of client_textmessage_s"][::std::mem::size_of::<client_textmessage_s>() - 44usize];
    ["Alignment of client_textmessage_s"][::std::mem::align_of::<client_textmessage_s>() - 4usize];
    ["Offset of field: client_textmessage_s::effect"]
        [::std::mem::offset_of!(client_textmessage_s, effect) - 0usize];
    ["Offset of field: client_textmessage_s::r1"]
        [::std::mem::offset_of!(client_textmessage_s, r1) - 4usize];
    ["Offset of field: client_textmessage_s::g1"]
        [::std::mem::offset_of!(client_textmessage_s, g1) - 5usize];
    ["Offset of field: client_textmessage_s::b1"]
        [::std::mem::offset_of!(client_textmessage_s, b1) - 6usize];
    ["Offset of field: client_textmessage_s::a1"]
        [::std::mem::offset_of!(client_textmessage_s, a1) - 7usize];
    ["Offset of field: client_textmessage_s::r2"]
        [::std::mem::offset_of!(client_textmessage_s, r2) - 8usize];
    ["Offset of field: client_textmessage_s::g2"]
        [::std::mem::offset_of!(client_textmessage_s, g2) - 9usize];
    ["Offset of field: client_textmessage_s::b2"]
        [::std::mem::offset_of!(client_textmessage_s, b2) - 10usize];
    ["Offset of field: client_textmessage_s::a2"]
        [::std::mem::offset_of!(client_textmessage_s, a2) - 11usize];
    ["Offset of field: client_textmessage_s::x"]
        [::std::mem::offset_of!(client_textmessage_s, x) - 12usize];
    ["Offset of field: client_textmessage_s::y"]
        [::std::mem::offset_of!(client_textmessage_s, y) - 16usize];
    ["Offset of field: client_textmessage_s::fadein"]
        [::std::mem::offset_of!(client_textmessage_s, fadein) - 20usize];
    ["Offset of field: client_textmessage_s::fadeout"]
        [::std::mem::offset_of!(client_textmessage_s, fadeout) - 24usize];
    ["Offset of field: client_textmessage_s::holdtime"]
        [::std::mem::offset_of!(client_textmessage_s, holdtime) - 28usize];
    ["Offset of field: client_textmessage_s::fxtime"]
        [::std::mem::offset_of!(client_textmessage_s, fxtime) - 32usize];
    ["Offset of field: client_textmessage_s::pName"]
        [::std::mem::offset_of!(client_textmessage_s, pName) - 36usize];
    ["Offset of field: client_textmessage_s::pMessage"]
        [::std::mem::offset_of!(client_textmessage_s, pMessage) - 40usize];
};
pub type client_textmessage_t = client_textmessage_s;
pub type sequenceCommandLine_s = sequenceCommandLine_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sequenceCommandLine_ {
    pub commandType: ::std::os::raw::c_int,
    pub clientMessage: client_textmessage_t,
    pub speakerName: *mut ::std::os::raw::c_char,
    pub listenerName: *mut ::std::os::raw::c_char,
    pub soundFileName: *mut ::std::os::raw::c_char,
    pub sentenceName: *mut ::std::os::raw::c_char,
    pub fireTargetNames: *mut ::std::os::raw::c_char,
    pub killTargetNames: *mut ::std::os::raw::c_char,
    pub delay: f32,
    pub repeatCount: ::std::os::raw::c_int,
    pub textChannel: ::std::os::raw::c_int,
    pub modifierBitField: ::std::os::raw::c_int,
    pub nextCommandLine: *mut sequenceCommandLine_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sequenceCommandLine_"][::std::mem::size_of::<sequenceCommandLine_>() - 92usize];
    ["Alignment of sequenceCommandLine_"][::std::mem::align_of::<sequenceCommandLine_>() - 4usize];
    ["Offset of field: sequenceCommandLine_::commandType"]
        [::std::mem::offset_of!(sequenceCommandLine_, commandType) - 0usize];
    ["Offset of field: sequenceCommandLine_::clientMessage"]
        [::std::mem::offset_of!(sequenceCommandLine_, clientMessage) - 4usize];
    ["Offset of field: sequenceCommandLine_::speakerName"]
        [::std::mem::offset_of!(sequenceCommandLine_, speakerName) - 48usize];
    ["Offset of field: sequenceCommandLine_::listenerName"]
        [::std::mem::offset_of!(sequenceCommandLine_, listenerName) - 52usize];
    ["Offset of field: sequenceCommandLine_::soundFileName"]
        [::std::mem::offset_of!(sequenceCommandLine_, soundFileName) - 56usize];
    ["Offset of field: sequenceCommandLine_::sentenceName"]
        [::std::mem::offset_of!(sequenceCommandLine_, sentenceName) - 60usize];
    ["Offset of field: sequenceCommandLine_::fireTargetNames"]
        [::std::mem::offset_of!(sequenceCommandLine_, fireTargetNames) - 64usize];
    ["Offset of field: sequenceCommandLine_::killTargetNames"]
        [::std::mem::offset_of!(sequenceCommandLine_, killTargetNames) - 68usize];
    ["Offset of field: sequenceCommandLine_::delay"]
        [::std::mem::offset_of!(sequenceCommandLine_, delay) - 72usize];
    ["Offset of field: sequenceCommandLine_::repeatCount"]
        [::std::mem::offset_of!(sequenceCommandLine_, repeatCount) - 76usize];
    ["Offset of field: sequenceCommandLine_::textChannel"]
        [::std::mem::offset_of!(sequenceCommandLine_, textChannel) - 80usize];
    ["Offset of field: sequenceCommandLine_::modifierBitField"]
        [::std::mem::offset_of!(sequenceCommandLine_, modifierBitField) - 84usize];
    ["Offset of field: sequenceCommandLine_::nextCommandLine"]
        [::std::mem::offset_of!(sequenceCommandLine_, nextCommandLine) - 88usize];
};
pub type sequenceEntry_s = sequenceEntry_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sequenceEntry_ {
    pub fileName: *mut ::std::os::raw::c_char,
    pub entryName: *mut ::std::os::raw::c_char,
    pub firstCommand: *mut sequenceCommandLine_s,
    pub nextEntry: *mut sequenceEntry_s,
    pub isGlobal: qboolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sequenceEntry_"][::std::mem::size_of::<sequenceEntry_>() - 20usize];
    ["Alignment of sequenceEntry_"][::std::mem::align_of::<sequenceEntry_>() - 4usize];
    ["Offset of field: sequenceEntry_::fileName"]
        [::std::mem::offset_of!(sequenceEntry_, fileName) - 0usize];
    ["Offset of field: sequenceEntry_::entryName"]
        [::std::mem::offset_of!(sequenceEntry_, entryName) - 4usize];
    ["Offset of field: sequenceEntry_::firstCommand"]
        [::std::mem::offset_of!(sequenceEntry_, firstCommand) - 8usize];
    ["Offset of field: sequenceEntry_::nextEntry"]
        [::std::mem::offset_of!(sequenceEntry_, nextEntry) - 12usize];
    ["Offset of field: sequenceEntry_::isGlobal"]
        [::std::mem::offset_of!(sequenceEntry_, isGlobal) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct enginefuncs_s {
    pub pfnPrecacheModel: ::std::option::Option<
        unsafe extern "C" fn(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnPrecacheSound: ::std::option::Option<
        unsafe extern "C" fn(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnSetModel: ::std::option::Option<
        unsafe extern "C" fn(e: *mut edict_t, m: *const ::std::os::raw::c_char),
    >,
    pub pfnModelIndex: ::std::option::Option<
        unsafe extern "C" fn(m: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnModelFrames: ::std::option::Option<
        unsafe extern "C" fn(modelIndex: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >,
    pub pfnSetSize: ::std::option::Option<
        unsafe extern "C" fn(e: *mut edict_t, rgflMin: *const f32, rgflMax: *const f32),
    >,
    pub pfnChangeLevel: ::std::option::Option<
        unsafe extern "C" fn(s1: *const ::std::os::raw::c_char, s2: *const ::std::os::raw::c_char),
    >,
    pub pfnGetSpawnParms: ::std::option::Option<unsafe extern "C" fn(ent: *mut edict_t)>,
    pub pfnSaveSpawnParms: ::std::option::Option<unsafe extern "C" fn(ent: *mut edict_t)>,
    pub pfnVecToYaw: ::std::option::Option<unsafe extern "C" fn(rgflVector: *const f32) -> f32>,
    pub pfnVecToAngles: ::std::option::Option<
        unsafe extern "C" fn(rgflVectorIn: *const f32, rgflVectorOut: *mut f32),
    >,
    pub pfnMoveToOrigin: ::std::option::Option<
        unsafe extern "C" fn(
            ent: *mut edict_t,
            pflGoal: *const f32,
            dist: f32,
            iMoveType: ::std::os::raw::c_int,
        ),
    >,
    pub pfnChangeYaw: ::std::option::Option<unsafe extern "C" fn(ent: *mut edict_t)>,
    pub pfnChangePitch: ::std::option::Option<unsafe extern "C" fn(ent: *mut edict_t)>,
    pub pfnFindEntityByString: ::std::option::Option<
        unsafe extern "C" fn(
            pEdictStartSearchAfter: *mut edict_t,
            pszField: *const ::std::os::raw::c_char,
            pszValue: *const ::std::os::raw::c_char,
        ) -> *mut edict_t,
    >,
    pub pfnGetEntityIllum:
        ::std::option::Option<unsafe extern "C" fn(pEnt: *mut edict_t) -> ::std::os::raw::c_int>,
    pub pfnFindEntityInSphere: ::std::option::Option<
        unsafe extern "C" fn(
            pEdictStartSearchAfter: *mut edict_t,
            org: *const f32,
            rad: f32,
        ) -> *mut edict_t,
    >,
    pub pfnFindClientInPVS:
        ::std::option::Option<unsafe extern "C" fn(pEdict: *mut edict_t) -> *mut edict_t>,
    pub pfnEntitiesInPVS:
        ::std::option::Option<unsafe extern "C" fn(pplayer: *mut edict_t) -> *mut edict_t>,
    pub pfnMakeVectors: ::std::option::Option<unsafe extern "C" fn(rgflVector: *const f32)>,
    pub pfnAngleVectors: ::std::option::Option<
        unsafe extern "C" fn(
            rgflVector: *const f32,
            forward: *mut f32,
            right: *mut f32,
            up: *mut f32,
        ),
    >,
    pub pfnCreateEntity: ::std::option::Option<unsafe extern "C" fn() -> *mut edict_t>,
    pub pfnRemoveEntity: ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t)>,
    pub pfnCreateNamedEntity: ::std::option::Option<
        unsafe extern "C" fn(className: ::std::os::raw::c_int) -> *mut edict_t,
    >,
    pub pfnMakeStatic: ::std::option::Option<unsafe extern "C" fn(ent: *mut edict_t)>,
    pub pfnEntIsOnFloor:
        ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t) -> ::std::os::raw::c_int>,
    pub pfnDropToFloor:
        ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t) -> ::std::os::raw::c_int>,
    pub pfnWalkMove: ::std::option::Option<
        unsafe extern "C" fn(
            ent: *mut edict_t,
            yaw: f32,
            dist: f32,
            iMode: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnSetOrigin:
        ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t, rgflOrigin: *const f32)>,
    pub pfnEmitSound: ::std::option::Option<
        unsafe extern "C" fn(
            entity: *mut edict_t,
            channel: ::std::os::raw::c_int,
            sample: *const ::std::os::raw::c_char,
            volume: f32,
            attenuation: f32,
            fFlags: ::std::os::raw::c_int,
            pitch: ::std::os::raw::c_int,
        ),
    >,
    pub pfnEmitAmbientSound: ::std::option::Option<
        unsafe extern "C" fn(
            entity: *mut edict_t,
            pos: *mut f32,
            samp: *const ::std::os::raw::c_char,
            vol: f32,
            attenuation: f32,
            fFlags: ::std::os::raw::c_int,
            pitch: ::std::os::raw::c_int,
        ),
    >,
    pub pfnTraceLine: ::std::option::Option<
        unsafe extern "C" fn(
            v1: *const f32,
            v2: *const f32,
            fNoMonsters: ::std::os::raw::c_int,
            pentToSkip: *mut edict_t,
            ptr: *mut TraceResult,
        ),
    >,
    pub pfnTraceToss: ::std::option::Option<
        unsafe extern "C" fn(pent: *mut edict_t, pentToIgnore: *mut edict_t, ptr: *mut TraceResult),
    >,
    pub pfnTraceMonsterHull: ::std::option::Option<
        unsafe extern "C" fn(
            pEdict: *mut edict_t,
            v1: *const f32,
            v2: *const f32,
            fNoMonsters: ::std::os::raw::c_int,
            pentToSkip: *mut edict_t,
            ptr: *mut TraceResult,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnTraceHull: ::std::option::Option<
        unsafe extern "C" fn(
            v1: *const f32,
            v2: *const f32,
            fNoMonsters: ::std::os::raw::c_int,
            hullNumber: ::std::os::raw::c_int,
            pentToSkip: *mut edict_t,
            ptr: *mut TraceResult,
        ),
    >,
    pub pfnTraceModel: ::std::option::Option<
        unsafe extern "C" fn(
            v1: *const f32,
            v2: *const f32,
            hullNumber: ::std::os::raw::c_int,
            pent: *mut edict_t,
            ptr: *mut TraceResult,
        ),
    >,
    pub pfnTraceTexture: ::std::option::Option<
        unsafe extern "C" fn(
            pTextureEntity: *mut edict_t,
            v1: *const f32,
            v2: *const f32,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub pfnTraceSphere: ::std::option::Option<
        unsafe extern "C" fn(
            v1: *const f32,
            v2: *const f32,
            fNoMonsters: ::std::os::raw::c_int,
            radius: f32,
            pentToSkip: *mut edict_t,
            ptr: *mut TraceResult,
        ),
    >,
    pub pfnGetAimVector: ::std::option::Option<
        unsafe extern "C" fn(ent: *mut edict_t, speed: f32, rgflReturn: *mut f32),
    >,
    pub pfnServerCommand:
        ::std::option::Option<unsafe extern "C" fn(str_: *const ::std::os::raw::c_char)>,
    pub pfnServerExecute: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnClientCommand: ::std::option::Option<
        unsafe extern "C" fn(pEdict: *mut edict_t, szFmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnParticleEffect: ::std::option::Option<
        unsafe extern "C" fn(org: *const f32, dir: *const f32, color: f32, count: f32),
    >,
    pub pfnLightStyle: ::std::option::Option<
        unsafe extern "C" fn(style: ::std::os::raw::c_int, val: *const ::std::os::raw::c_char),
    >,
    pub pfnDecalIndex: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnPointContents: ::std::option::Option<
        unsafe extern "C" fn(rgflVector: *const f32) -> ::std::os::raw::c_int,
    >,
    pub pfnMessageBegin: ::std::option::Option<
        unsafe extern "C" fn(
            msg_dest: ::std::os::raw::c_int,
            msg_type: ::std::os::raw::c_int,
            pOrigin: *const f32,
            ed: *mut edict_t,
        ),
    >,
    pub pfnMessageEnd: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnWriteByte: ::std::option::Option<unsafe extern "C" fn(iValue: ::std::os::raw::c_int)>,
    pub pfnWriteChar: ::std::option::Option<unsafe extern "C" fn(iValue: ::std::os::raw::c_int)>,
    pub pfnWriteShort: ::std::option::Option<unsafe extern "C" fn(iValue: ::std::os::raw::c_int)>,
    pub pfnWriteLong: ::std::option::Option<unsafe extern "C" fn(iValue: ::std::os::raw::c_int)>,
    pub pfnWriteAngle: ::std::option::Option<unsafe extern "C" fn(flValue: f32)>,
    pub pfnWriteCoord: ::std::option::Option<unsafe extern "C" fn(flValue: f32)>,
    pub pfnWriteString:
        ::std::option::Option<unsafe extern "C" fn(sz: *const ::std::os::raw::c_char)>,
    pub pfnWriteEntity: ::std::option::Option<unsafe extern "C" fn(iValue: ::std::os::raw::c_int)>,
    pub pfnCVarRegister: ::std::option::Option<unsafe extern "C" fn(pCvar: *mut cvar_t)>,
    pub pfnCVarGetFloat: ::std::option::Option<
        unsafe extern "C" fn(szVarName: *const ::std::os::raw::c_char) -> f32,
    >,
    pub pfnCVarGetString: ::std::option::Option<
        unsafe extern "C" fn(
            szVarName: *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub pfnCVarSetFloat: ::std::option::Option<
        unsafe extern "C" fn(szVarName: *const ::std::os::raw::c_char, flValue: f32),
    >,
    pub pfnCVarSetString: ::std::option::Option<
        unsafe extern "C" fn(
            szVarName: *const ::std::os::raw::c_char,
            szValue: *const ::std::os::raw::c_char,
        ),
    >,
    pub pfnAlertMessage: ::std::option::Option<
        unsafe extern "C" fn(atype: ALERT_TYPE, szFmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnEngineFprintf: ::std::option::Option<
        unsafe extern "C" fn(
            pfile: *mut ::std::os::raw::c_void,
            szFmt: *const ::std::os::raw::c_char,
            ...
        ),
    >,
    pub pfnPvAllocEntPrivateData: ::std::option::Option<
        unsafe extern "C" fn(pEdict: *mut edict_t, cb: int32) -> *mut ::std::os::raw::c_void,
    >,
    pub pfnPvEntPrivateData: ::std::option::Option<
        unsafe extern "C" fn(pEdict: *mut edict_t) -> *mut ::std::os::raw::c_void,
    >,
    pub pfnFreeEntPrivateData: ::std::option::Option<unsafe extern "C" fn(pEdict: *mut edict_t)>,
    pub pfnSzFromIndex: ::std::option::Option<
        unsafe extern "C" fn(iString: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char,
    >,
    pub pfnAllocString: ::std::option::Option<
        unsafe extern "C" fn(szValue: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnGetVarsOfEnt:
        ::std::option::Option<unsafe extern "C" fn(pEdict: *mut edict_t) -> *mut entvars_s>,
    pub pfnPEntityOfEntOffset: ::std::option::Option<
        unsafe extern "C" fn(iEntOffset: ::std::os::raw::c_int) -> *mut edict_t,
    >,
    pub pfnEntOffsetOfPEntity: ::std::option::Option<
        unsafe extern "C" fn(pEdict: *const edict_t) -> ::std::os::raw::c_int,
    >,
    pub pfnIndexOfEdict: ::std::option::Option<
        unsafe extern "C" fn(pEdict: *const edict_t) -> ::std::os::raw::c_int,
    >,
    pub pfnPEntityOfEntIndex: ::std::option::Option<
        unsafe extern "C" fn(iEntIndex: ::std::os::raw::c_int) -> *mut edict_t,
    >,
    pub pfnFindEntityByVars:
        ::std::option::Option<unsafe extern "C" fn(pvars: *mut entvars_s) -> *mut edict_t>,
    pub pfnGetModelPtr: ::std::option::Option<
        unsafe extern "C" fn(pEdict: *mut edict_t) -> *mut ::std::os::raw::c_void,
    >,
    pub pfnRegUserMsg: ::std::option::Option<
        unsafe extern "C" fn(
            pszName: *const ::std::os::raw::c_char,
            iSize: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnAnimationAutomove:
        ::std::option::Option<unsafe extern "C" fn(pEdict: *const edict_t, flTime: f32)>,
    pub pfnGetBonePosition: ::std::option::Option<
        unsafe extern "C" fn(
            pEdict: *const edict_t,
            iBone: ::std::os::raw::c_int,
            rgflOrigin: *mut f32,
            rgflAngles: *mut f32,
        ),
    >,
    pub pfnFunctionFromName:
        ::std::option::Option<unsafe extern "C" fn(pName: *const ::std::os::raw::c_char) -> uint32>,
    pub pfnNameForFunction: ::std::option::Option<
        unsafe extern "C" fn(function: uint32) -> *const ::std::os::raw::c_char,
    >,
    pub pfnClientPrintf: ::std::option::Option<
        unsafe extern "C" fn(
            pEdict: *mut edict_t,
            ptype: PRINT_TYPE,
            szMsg: *const ::std::os::raw::c_char,
        ),
    >,
    pub pfnServerPrint:
        ::std::option::Option<unsafe extern "C" fn(szMsg: *const ::std::os::raw::c_char)>,
    pub pfnCmd_Args: ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
    pub pfnCmd_Argv: ::std::option::Option<
        unsafe extern "C" fn(argc: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char,
    >,
    pub pfnCmd_Argc: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub pfnGetAttachment: ::std::option::Option<
        unsafe extern "C" fn(
            pEdict: *const edict_t,
            iAttachment: ::std::os::raw::c_int,
            rgflOrigin: *mut f32,
            rgflAngles: *mut f32,
        ),
    >,
    pub pfnCRC32_Init: ::std::option::Option<unsafe extern "C" fn(pulCRC: *mut CRC32_t)>,
    pub pfnCRC32_ProcessBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            pulCRC: *mut CRC32_t,
            p: *mut ::std::os::raw::c_void,
            len: ::std::os::raw::c_int,
        ),
    >,
    pub pfnCRC32_ProcessByte: ::std::option::Option<
        unsafe extern "C" fn(pulCRC: *mut CRC32_t, ch: ::std::os::raw::c_uchar),
    >,
    pub pfnCRC32_Final: ::std::option::Option<unsafe extern "C" fn(pulCRC: CRC32_t) -> CRC32_t>,
    pub pfnRandomLong:
        ::std::option::Option<unsafe extern "C" fn(lLow: int32, lHigh: int32) -> int32>,
    pub pfnRandomFloat: ::std::option::Option<unsafe extern "C" fn(flLow: f32, flHigh: f32) -> f32>,
    pub pfnSetView: ::std::option::Option<
        unsafe extern "C" fn(pClient: *const edict_t, pViewent: *const edict_t),
    >,
    pub pfnTime: ::std::option::Option<unsafe extern "C" fn() -> f32>,
    pub pfnCrosshairAngle:
        ::std::option::Option<unsafe extern "C" fn(pClient: *const edict_t, pitch: f32, yaw: f32)>,
    pub pfnLoadFileForMe: ::std::option::Option<
        unsafe extern "C" fn(
            filename: *const ::std::os::raw::c_char,
            pLength: *mut ::std::os::raw::c_int,
        ) -> *mut byte,
    >,
    pub pfnFreeFile:
        ::std::option::Option<unsafe extern "C" fn(buffer: *mut ::std::os::raw::c_void)>,
    pub pfnEndSection:
        ::std::option::Option<unsafe extern "C" fn(pszSectionName: *const ::std::os::raw::c_char)>,
    pub pfnCompareFileTime: ::std::option::Option<
        unsafe extern "C" fn(
            filename1: *mut ::std::os::raw::c_char,
            filename2: *mut ::std::os::raw::c_char,
            iCompare: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnGetGameDir:
        ::std::option::Option<unsafe extern "C" fn(szGetGameDir: *mut ::std::os::raw::c_char)>,
    pub pfnCvar_RegisterVariable:
        ::std::option::Option<unsafe extern "C" fn(variable: *mut cvar_t)>,
    pub pfnFadeClientVolume: ::std::option::Option<
        unsafe extern "C" fn(
            pEdict: *const edict_t,
            fadePercent: ::std::os::raw::c_int,
            fadeOutSeconds: ::std::os::raw::c_int,
            holdTime: ::std::os::raw::c_int,
            fadeInSeconds: ::std::os::raw::c_int,
        ),
    >,
    pub pfnSetClientMaxspeed:
        ::std::option::Option<unsafe extern "C" fn(pEdict: *const edict_t, fNewMaxspeed: f32)>,
    pub pfnCreateFakeClient: ::std::option::Option<
        unsafe extern "C" fn(netname: *const ::std::os::raw::c_char) -> *mut edict_t,
    >,
    pub pfnRunPlayerMove: ::std::option::Option<
        unsafe extern "C" fn(
            fakeclient: *mut edict_t,
            viewangles: *const f32,
            forwardmove: f32,
            sidemove: f32,
            upmove: f32,
            buttons: ::std::os::raw::c_ushort,
            impulse: byte,
            msec: byte,
        ),
    >,
    pub pfnNumberOfEntities: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub pfnGetInfoKeyBuffer:
        ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t) -> *mut ::std::os::raw::c_char>,
    pub pfnInfoKeyValue: ::std::option::Option<
        unsafe extern "C" fn(
            infobuffer: *mut ::std::os::raw::c_char,
            key: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub pfnSetKeyValue: ::std::option::Option<
        unsafe extern "C" fn(
            infobuffer: *mut ::std::os::raw::c_char,
            key: *const ::std::os::raw::c_char,
            value: *const ::std::os::raw::c_char,
        ),
    >,
    pub pfnSetClientKeyValue: ::std::option::Option<
        unsafe extern "C" fn(
            clientIndex: ::std::os::raw::c_int,
            infobuffer: *mut ::std::os::raw::c_char,
            key: *const ::std::os::raw::c_char,
            value: *const ::std::os::raw::c_char,
        ),
    >,
    pub pfnIsMapValid: ::std::option::Option<
        unsafe extern "C" fn(filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnStaticDecal: ::std::option::Option<
        unsafe extern "C" fn(
            origin: *const f32,
            decalIndex: ::std::os::raw::c_int,
            entityIndex: ::std::os::raw::c_int,
            modelIndex: ::std::os::raw::c_int,
        ),
    >,
    pub pfnPrecacheGeneric: ::std::option::Option<
        unsafe extern "C" fn(s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnGetPlayerUserId:
        ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t) -> ::std::os::raw::c_int>,
    pub pfnBuildSoundMsg: ::std::option::Option<
        unsafe extern "C" fn(
            entity: *mut edict_t,
            channel: ::std::os::raw::c_int,
            sample: *const ::std::os::raw::c_char,
            volume: f32,
            attenuation: f32,
            fFlags: ::std::os::raw::c_int,
            pitch: ::std::os::raw::c_int,
            msg_dest: ::std::os::raw::c_int,
            msg_type: ::std::os::raw::c_int,
            pOrigin: *const f32,
            ed: *mut edict_t,
        ),
    >,
    pub pfnIsDedicatedServer:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub pfnCVarGetPointer: ::std::option::Option<
        unsafe extern "C" fn(szVarName: *const ::std::os::raw::c_char) -> *mut cvar_t,
    >,
    pub pfnGetPlayerWONId:
        ::std::option::Option<unsafe extern "C" fn(e: *mut edict_t) -> ::std::os::raw::c_uint>,
    pub pfnInfo_RemoveKey: ::std::option::Option<
        unsafe extern "C" fn(s: *mut ::std::os::raw::c_char, key: *const ::std::os::raw::c_char),
    >,
    pub pfnGetPhysicsKeyValue: ::std::option::Option<
        unsafe extern "C" fn(
            pClient: *const edict_t,
            key: *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub pfnSetPhysicsKeyValue: ::std::option::Option<
        unsafe extern "C" fn(
            pClient: *const edict_t,
            key: *const ::std::os::raw::c_char,
            value: *const ::std::os::raw::c_char,
        ),
    >,
    pub pfnGetPhysicsInfoString: ::std::option::Option<
        unsafe extern "C" fn(pClient: *const edict_t) -> *const ::std::os::raw::c_char,
    >,
    pub pfnPrecacheEvent: ::std::option::Option<
        unsafe extern "C" fn(
            type_: ::std::os::raw::c_int,
            psz: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_ushort,
    >,
    pub pfnPlaybackEvent: ::std::option::Option<
        unsafe extern "C" fn(
            flags: ::std::os::raw::c_int,
            pInvoker: *const edict_t,
            eventindex: ::std::os::raw::c_ushort,
            delay: f32,
            origin: *mut f32,
            angles: *mut f32,
            fparam1: f32,
            fparam2: f32,
            iparam1: ::std::os::raw::c_int,
            iparam2: ::std::os::raw::c_int,
            bparam1: ::std::os::raw::c_int,
            bparam2: ::std::os::raw::c_int,
        ),
    >,
    pub pfnSetFatPVS:
        ::std::option::Option<unsafe extern "C" fn(org: *mut f32) -> *mut ::std::os::raw::c_uchar>,
    pub pfnSetFatPAS:
        ::std::option::Option<unsafe extern "C" fn(org: *mut f32) -> *mut ::std::os::raw::c_uchar>,
    pub pfnCheckVisibility: ::std::option::Option<
        unsafe extern "C" fn(
            entity: *const edict_t,
            pset: *mut ::std::os::raw::c_uchar,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnDeltaSetField: ::std::option::Option<
        unsafe extern "C" fn(pFields: *mut delta_s, fieldname: *const ::std::os::raw::c_char),
    >,
    pub pfnDeltaUnsetField: ::std::option::Option<
        unsafe extern "C" fn(pFields: *mut delta_s, fieldname: *const ::std::os::raw::c_char),
    >,
    pub pfnDeltaAddEncoder: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            conditionalencode: ::std::option::Option<
                unsafe extern "C" fn(
                    pFields: *mut delta_s,
                    from: *const ::std::os::raw::c_uchar,
                    to: *const ::std::os::raw::c_uchar,
                ),
            >,
        ),
    >,
    pub pfnGetCurrentPlayer: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub pfnCanSkipPlayer: ::std::option::Option<
        unsafe extern "C" fn(player: *const edict_t) -> ::std::os::raw::c_int,
    >,
    pub pfnDeltaFindField: ::std::option::Option<
        unsafe extern "C" fn(
            pFields: *mut delta_s,
            fieldname: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnDeltaSetFieldByIndex: ::std::option::Option<
        unsafe extern "C" fn(pFields: *mut delta_s, fieldNumber: ::std::os::raw::c_int),
    >,
    pub pfnDeltaUnsetFieldByIndex: ::std::option::Option<
        unsafe extern "C" fn(pFields: *mut delta_s, fieldNumber: ::std::os::raw::c_int),
    >,
    pub pfnSetGroupMask: ::std::option::Option<
        unsafe extern "C" fn(mask: ::std::os::raw::c_int, op: ::std::os::raw::c_int),
    >,
    pub pfnCreateInstancedBaseline: ::std::option::Option<
        unsafe extern "C" fn(
            classname: ::std::os::raw::c_int,
            baseline: *mut entity_state_s,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnCvar_DirectSet: ::std::option::Option<
        unsafe extern "C" fn(var: *mut cvar_s, value: *const ::std::os::raw::c_char),
    >,
    pub pfnForceUnmodified: ::std::option::Option<
        unsafe extern "C" fn(
            type_: FORCE_TYPE,
            mins: *mut f32,
            maxs: *mut f32,
            filename: *const ::std::os::raw::c_char,
        ),
    >,
    pub pfnGetPlayerStats: ::std::option::Option<
        unsafe extern "C" fn(
            pClient: *const edict_t,
            ping: *mut ::std::os::raw::c_int,
            packet_loss: *mut ::std::os::raw::c_int,
        ),
    >,
    pub pfnAddServerCommand: ::std::option::Option<
        unsafe extern "C" fn(
            cmd_name: *const ::std::os::raw::c_char,
            function: ::std::option::Option<unsafe extern "C" fn()>,
        ),
    >,
    pub pfnVoice_GetClientListening: ::std::option::Option<
        unsafe extern "C" fn(
            iReceiver: ::std::os::raw::c_int,
            iSender: ::std::os::raw::c_int,
        ) -> qboolean,
    >,
    pub pfnVoice_SetClientListening: ::std::option::Option<
        unsafe extern "C" fn(
            iReceiver: ::std::os::raw::c_int,
            iSender: ::std::os::raw::c_int,
            bListen: qboolean,
        ) -> qboolean,
    >,
    pub pfnGetPlayerAuthId: ::std::option::Option<
        unsafe extern "C" fn(e: *mut edict_t) -> *const ::std::os::raw::c_char,
    >,
    pub pfnSequenceGet: ::std::option::Option<
        unsafe extern "C" fn(
            fileName: *const ::std::os::raw::c_char,
            entryName: *const ::std::os::raw::c_char,
        ) -> *mut sequenceEntry_s,
    >,
    pub pfnSequencePickSentence: ::std::option::Option<
        unsafe extern "C" fn(
            groupName: *const ::std::os::raw::c_char,
            pickMethod: ::std::os::raw::c_int,
            picked: *mut ::std::os::raw::c_int,
        ) -> *mut sentenceEntry_s,
    >,
    pub pfnGetFileSize: ::std::option::Option<
        unsafe extern "C" fn(filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnGetApproxWavePlayLen: ::std::option::Option<
        unsafe extern "C" fn(filepath: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint,
    >,
    pub pfnIsCareerMatch: ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
    pub pfnGetLocalizedStringLength: ::std::option::Option<
        unsafe extern "C" fn(label: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
    >,
    pub pfnRegisterTutorMessageShown:
        ::std::option::Option<unsafe extern "C" fn(mid: ::std::os::raw::c_int)>,
    pub pfnGetTimesTutorMessageShown: ::std::option::Option<
        unsafe extern "C" fn(mid: ::std::os::raw::c_int) -> ::std::os::raw::c_int,
    >,
    pub pfnProcessTutorMessageDecayBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            buffer: *mut ::std::os::raw::c_int,
            bufferLength: ::std::os::raw::c_int,
        ),
    >,
    pub pfnConstructTutorMessageDecayBuffer: ::std::option::Option<
        unsafe extern "C" fn(
            buffer: *mut ::std::os::raw::c_int,
            bufferLength: ::std::os::raw::c_int,
        ),
    >,
    pub pfnResetTutorMessageDecayData: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnQueryClientCvarValue: ::std::option::Option<
        unsafe extern "C" fn(player: *const edict_t, cvarName: *const ::std::os::raw::c_char),
    >,
    pub pfnQueryClientCvarValue2: ::std::option::Option<
        unsafe extern "C" fn(
            player: *const edict_t,
            cvarName: *const ::std::os::raw::c_char,
            requestID: ::std::os::raw::c_int,
        ),
    >,
    pub pfnCheckParm: ::std::option::Option<
        unsafe extern "C" fn(
            pchCmdLineToken: *const ::std::os::raw::c_char,
            ppnext: *mut *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of enginefuncs_s"][::std::mem::size_of::<enginefuncs_s>() - 632usize];
    ["Alignment of enginefuncs_s"][::std::mem::align_of::<enginefuncs_s>() - 4usize];
    ["Offset of field: enginefuncs_s::pfnPrecacheModel"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPrecacheModel) - 0usize];
    ["Offset of field: enginefuncs_s::pfnPrecacheSound"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPrecacheSound) - 4usize];
    ["Offset of field: enginefuncs_s::pfnSetModel"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetModel) - 8usize];
    ["Offset of field: enginefuncs_s::pfnModelIndex"]
        [::std::mem::offset_of!(enginefuncs_s, pfnModelIndex) - 12usize];
    ["Offset of field: enginefuncs_s::pfnModelFrames"]
        [::std::mem::offset_of!(enginefuncs_s, pfnModelFrames) - 16usize];
    ["Offset of field: enginefuncs_s::pfnSetSize"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetSize) - 20usize];
    ["Offset of field: enginefuncs_s::pfnChangeLevel"]
        [::std::mem::offset_of!(enginefuncs_s, pfnChangeLevel) - 24usize];
    ["Offset of field: enginefuncs_s::pfnGetSpawnParms"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetSpawnParms) - 28usize];
    ["Offset of field: enginefuncs_s::pfnSaveSpawnParms"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSaveSpawnParms) - 32usize];
    ["Offset of field: enginefuncs_s::pfnVecToYaw"]
        [::std::mem::offset_of!(enginefuncs_s, pfnVecToYaw) - 36usize];
    ["Offset of field: enginefuncs_s::pfnVecToAngles"]
        [::std::mem::offset_of!(enginefuncs_s, pfnVecToAngles) - 40usize];
    ["Offset of field: enginefuncs_s::pfnMoveToOrigin"]
        [::std::mem::offset_of!(enginefuncs_s, pfnMoveToOrigin) - 44usize];
    ["Offset of field: enginefuncs_s::pfnChangeYaw"]
        [::std::mem::offset_of!(enginefuncs_s, pfnChangeYaw) - 48usize];
    ["Offset of field: enginefuncs_s::pfnChangePitch"]
        [::std::mem::offset_of!(enginefuncs_s, pfnChangePitch) - 52usize];
    ["Offset of field: enginefuncs_s::pfnFindEntityByString"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFindEntityByString) - 56usize];
    ["Offset of field: enginefuncs_s::pfnGetEntityIllum"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetEntityIllum) - 60usize];
    ["Offset of field: enginefuncs_s::pfnFindEntityInSphere"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFindEntityInSphere) - 64usize];
    ["Offset of field: enginefuncs_s::pfnFindClientInPVS"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFindClientInPVS) - 68usize];
    ["Offset of field: enginefuncs_s::pfnEntitiesInPVS"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEntitiesInPVS) - 72usize];
    ["Offset of field: enginefuncs_s::pfnMakeVectors"]
        [::std::mem::offset_of!(enginefuncs_s, pfnMakeVectors) - 76usize];
    ["Offset of field: enginefuncs_s::pfnAngleVectors"]
        [::std::mem::offset_of!(enginefuncs_s, pfnAngleVectors) - 80usize];
    ["Offset of field: enginefuncs_s::pfnCreateEntity"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCreateEntity) - 84usize];
    ["Offset of field: enginefuncs_s::pfnRemoveEntity"]
        [::std::mem::offset_of!(enginefuncs_s, pfnRemoveEntity) - 88usize];
    ["Offset of field: enginefuncs_s::pfnCreateNamedEntity"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCreateNamedEntity) - 92usize];
    ["Offset of field: enginefuncs_s::pfnMakeStatic"]
        [::std::mem::offset_of!(enginefuncs_s, pfnMakeStatic) - 96usize];
    ["Offset of field: enginefuncs_s::pfnEntIsOnFloor"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEntIsOnFloor) - 100usize];
    ["Offset of field: enginefuncs_s::pfnDropToFloor"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDropToFloor) - 104usize];
    ["Offset of field: enginefuncs_s::pfnWalkMove"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWalkMove) - 108usize];
    ["Offset of field: enginefuncs_s::pfnSetOrigin"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetOrigin) - 112usize];
    ["Offset of field: enginefuncs_s::pfnEmitSound"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEmitSound) - 116usize];
    ["Offset of field: enginefuncs_s::pfnEmitAmbientSound"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEmitAmbientSound) - 120usize];
    ["Offset of field: enginefuncs_s::pfnTraceLine"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceLine) - 124usize];
    ["Offset of field: enginefuncs_s::pfnTraceToss"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceToss) - 128usize];
    ["Offset of field: enginefuncs_s::pfnTraceMonsterHull"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceMonsterHull) - 132usize];
    ["Offset of field: enginefuncs_s::pfnTraceHull"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceHull) - 136usize];
    ["Offset of field: enginefuncs_s::pfnTraceModel"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceModel) - 140usize];
    ["Offset of field: enginefuncs_s::pfnTraceTexture"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceTexture) - 144usize];
    ["Offset of field: enginefuncs_s::pfnTraceSphere"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTraceSphere) - 148usize];
    ["Offset of field: enginefuncs_s::pfnGetAimVector"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetAimVector) - 152usize];
    ["Offset of field: enginefuncs_s::pfnServerCommand"]
        [::std::mem::offset_of!(enginefuncs_s, pfnServerCommand) - 156usize];
    ["Offset of field: enginefuncs_s::pfnServerExecute"]
        [::std::mem::offset_of!(enginefuncs_s, pfnServerExecute) - 160usize];
    ["Offset of field: enginefuncs_s::pfnClientCommand"]
        [::std::mem::offset_of!(enginefuncs_s, pfnClientCommand) - 164usize];
    ["Offset of field: enginefuncs_s::pfnParticleEffect"]
        [::std::mem::offset_of!(enginefuncs_s, pfnParticleEffect) - 168usize];
    ["Offset of field: enginefuncs_s::pfnLightStyle"]
        [::std::mem::offset_of!(enginefuncs_s, pfnLightStyle) - 172usize];
    ["Offset of field: enginefuncs_s::pfnDecalIndex"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDecalIndex) - 176usize];
    ["Offset of field: enginefuncs_s::pfnPointContents"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPointContents) - 180usize];
    ["Offset of field: enginefuncs_s::pfnMessageBegin"]
        [::std::mem::offset_of!(enginefuncs_s, pfnMessageBegin) - 184usize];
    ["Offset of field: enginefuncs_s::pfnMessageEnd"]
        [::std::mem::offset_of!(enginefuncs_s, pfnMessageEnd) - 188usize];
    ["Offset of field: enginefuncs_s::pfnWriteByte"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteByte) - 192usize];
    ["Offset of field: enginefuncs_s::pfnWriteChar"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteChar) - 196usize];
    ["Offset of field: enginefuncs_s::pfnWriteShort"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteShort) - 200usize];
    ["Offset of field: enginefuncs_s::pfnWriteLong"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteLong) - 204usize];
    ["Offset of field: enginefuncs_s::pfnWriteAngle"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteAngle) - 208usize];
    ["Offset of field: enginefuncs_s::pfnWriteCoord"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteCoord) - 212usize];
    ["Offset of field: enginefuncs_s::pfnWriteString"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteString) - 216usize];
    ["Offset of field: enginefuncs_s::pfnWriteEntity"]
        [::std::mem::offset_of!(enginefuncs_s, pfnWriteEntity) - 220usize];
    ["Offset of field: enginefuncs_s::pfnCVarRegister"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCVarRegister) - 224usize];
    ["Offset of field: enginefuncs_s::pfnCVarGetFloat"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCVarGetFloat) - 228usize];
    ["Offset of field: enginefuncs_s::pfnCVarGetString"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCVarGetString) - 232usize];
    ["Offset of field: enginefuncs_s::pfnCVarSetFloat"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCVarSetFloat) - 236usize];
    ["Offset of field: enginefuncs_s::pfnCVarSetString"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCVarSetString) - 240usize];
    ["Offset of field: enginefuncs_s::pfnAlertMessage"]
        [::std::mem::offset_of!(enginefuncs_s, pfnAlertMessage) - 244usize];
    ["Offset of field: enginefuncs_s::pfnEngineFprintf"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEngineFprintf) - 248usize];
    ["Offset of field: enginefuncs_s::pfnPvAllocEntPrivateData"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPvAllocEntPrivateData) - 252usize];
    ["Offset of field: enginefuncs_s::pfnPvEntPrivateData"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPvEntPrivateData) - 256usize];
    ["Offset of field: enginefuncs_s::pfnFreeEntPrivateData"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFreeEntPrivateData) - 260usize];
    ["Offset of field: enginefuncs_s::pfnSzFromIndex"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSzFromIndex) - 264usize];
    ["Offset of field: enginefuncs_s::pfnAllocString"]
        [::std::mem::offset_of!(enginefuncs_s, pfnAllocString) - 268usize];
    ["Offset of field: enginefuncs_s::pfnGetVarsOfEnt"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetVarsOfEnt) - 272usize];
    ["Offset of field: enginefuncs_s::pfnPEntityOfEntOffset"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPEntityOfEntOffset) - 276usize];
    ["Offset of field: enginefuncs_s::pfnEntOffsetOfPEntity"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEntOffsetOfPEntity) - 280usize];
    ["Offset of field: enginefuncs_s::pfnIndexOfEdict"]
        [::std::mem::offset_of!(enginefuncs_s, pfnIndexOfEdict) - 284usize];
    ["Offset of field: enginefuncs_s::pfnPEntityOfEntIndex"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPEntityOfEntIndex) - 288usize];
    ["Offset of field: enginefuncs_s::pfnFindEntityByVars"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFindEntityByVars) - 292usize];
    ["Offset of field: enginefuncs_s::pfnGetModelPtr"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetModelPtr) - 296usize];
    ["Offset of field: enginefuncs_s::pfnRegUserMsg"]
        [::std::mem::offset_of!(enginefuncs_s, pfnRegUserMsg) - 300usize];
    ["Offset of field: enginefuncs_s::pfnAnimationAutomove"]
        [::std::mem::offset_of!(enginefuncs_s, pfnAnimationAutomove) - 304usize];
    ["Offset of field: enginefuncs_s::pfnGetBonePosition"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetBonePosition) - 308usize];
    ["Offset of field: enginefuncs_s::pfnFunctionFromName"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFunctionFromName) - 312usize];
    ["Offset of field: enginefuncs_s::pfnNameForFunction"]
        [::std::mem::offset_of!(enginefuncs_s, pfnNameForFunction) - 316usize];
    ["Offset of field: enginefuncs_s::pfnClientPrintf"]
        [::std::mem::offset_of!(enginefuncs_s, pfnClientPrintf) - 320usize];
    ["Offset of field: enginefuncs_s::pfnServerPrint"]
        [::std::mem::offset_of!(enginefuncs_s, pfnServerPrint) - 324usize];
    ["Offset of field: enginefuncs_s::pfnCmd_Args"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCmd_Args) - 328usize];
    ["Offset of field: enginefuncs_s::pfnCmd_Argv"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCmd_Argv) - 332usize];
    ["Offset of field: enginefuncs_s::pfnCmd_Argc"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCmd_Argc) - 336usize];
    ["Offset of field: enginefuncs_s::pfnGetAttachment"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetAttachment) - 340usize];
    ["Offset of field: enginefuncs_s::pfnCRC32_Init"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCRC32_Init) - 344usize];
    ["Offset of field: enginefuncs_s::pfnCRC32_ProcessBuffer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCRC32_ProcessBuffer) - 348usize];
    ["Offset of field: enginefuncs_s::pfnCRC32_ProcessByte"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCRC32_ProcessByte) - 352usize];
    ["Offset of field: enginefuncs_s::pfnCRC32_Final"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCRC32_Final) - 356usize];
    ["Offset of field: enginefuncs_s::pfnRandomLong"]
        [::std::mem::offset_of!(enginefuncs_s, pfnRandomLong) - 360usize];
    ["Offset of field: enginefuncs_s::pfnRandomFloat"]
        [::std::mem::offset_of!(enginefuncs_s, pfnRandomFloat) - 364usize];
    ["Offset of field: enginefuncs_s::pfnSetView"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetView) - 368usize];
    ["Offset of field: enginefuncs_s::pfnTime"]
        [::std::mem::offset_of!(enginefuncs_s, pfnTime) - 372usize];
    ["Offset of field: enginefuncs_s::pfnCrosshairAngle"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCrosshairAngle) - 376usize];
    ["Offset of field: enginefuncs_s::pfnLoadFileForMe"]
        [::std::mem::offset_of!(enginefuncs_s, pfnLoadFileForMe) - 380usize];
    ["Offset of field: enginefuncs_s::pfnFreeFile"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFreeFile) - 384usize];
    ["Offset of field: enginefuncs_s::pfnEndSection"]
        [::std::mem::offset_of!(enginefuncs_s, pfnEndSection) - 388usize];
    ["Offset of field: enginefuncs_s::pfnCompareFileTime"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCompareFileTime) - 392usize];
    ["Offset of field: enginefuncs_s::pfnGetGameDir"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetGameDir) - 396usize];
    ["Offset of field: enginefuncs_s::pfnCvar_RegisterVariable"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCvar_RegisterVariable) - 400usize];
    ["Offset of field: enginefuncs_s::pfnFadeClientVolume"]
        [::std::mem::offset_of!(enginefuncs_s, pfnFadeClientVolume) - 404usize];
    ["Offset of field: enginefuncs_s::pfnSetClientMaxspeed"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetClientMaxspeed) - 408usize];
    ["Offset of field: enginefuncs_s::pfnCreateFakeClient"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCreateFakeClient) - 412usize];
    ["Offset of field: enginefuncs_s::pfnRunPlayerMove"]
        [::std::mem::offset_of!(enginefuncs_s, pfnRunPlayerMove) - 416usize];
    ["Offset of field: enginefuncs_s::pfnNumberOfEntities"]
        [::std::mem::offset_of!(enginefuncs_s, pfnNumberOfEntities) - 420usize];
    ["Offset of field: enginefuncs_s::pfnGetInfoKeyBuffer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetInfoKeyBuffer) - 424usize];
    ["Offset of field: enginefuncs_s::pfnInfoKeyValue"]
        [::std::mem::offset_of!(enginefuncs_s, pfnInfoKeyValue) - 428usize];
    ["Offset of field: enginefuncs_s::pfnSetKeyValue"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetKeyValue) - 432usize];
    ["Offset of field: enginefuncs_s::pfnSetClientKeyValue"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetClientKeyValue) - 436usize];
    ["Offset of field: enginefuncs_s::pfnIsMapValid"]
        [::std::mem::offset_of!(enginefuncs_s, pfnIsMapValid) - 440usize];
    ["Offset of field: enginefuncs_s::pfnStaticDecal"]
        [::std::mem::offset_of!(enginefuncs_s, pfnStaticDecal) - 444usize];
    ["Offset of field: enginefuncs_s::pfnPrecacheGeneric"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPrecacheGeneric) - 448usize];
    ["Offset of field: enginefuncs_s::pfnGetPlayerUserId"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetPlayerUserId) - 452usize];
    ["Offset of field: enginefuncs_s::pfnBuildSoundMsg"]
        [::std::mem::offset_of!(enginefuncs_s, pfnBuildSoundMsg) - 456usize];
    ["Offset of field: enginefuncs_s::pfnIsDedicatedServer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnIsDedicatedServer) - 460usize];
    ["Offset of field: enginefuncs_s::pfnCVarGetPointer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCVarGetPointer) - 464usize];
    ["Offset of field: enginefuncs_s::pfnGetPlayerWONId"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetPlayerWONId) - 468usize];
    ["Offset of field: enginefuncs_s::pfnInfo_RemoveKey"]
        [::std::mem::offset_of!(enginefuncs_s, pfnInfo_RemoveKey) - 472usize];
    ["Offset of field: enginefuncs_s::pfnGetPhysicsKeyValue"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetPhysicsKeyValue) - 476usize];
    ["Offset of field: enginefuncs_s::pfnSetPhysicsKeyValue"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetPhysicsKeyValue) - 480usize];
    ["Offset of field: enginefuncs_s::pfnGetPhysicsInfoString"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetPhysicsInfoString) - 484usize];
    ["Offset of field: enginefuncs_s::pfnPrecacheEvent"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPrecacheEvent) - 488usize];
    ["Offset of field: enginefuncs_s::pfnPlaybackEvent"]
        [::std::mem::offset_of!(enginefuncs_s, pfnPlaybackEvent) - 492usize];
    ["Offset of field: enginefuncs_s::pfnSetFatPVS"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetFatPVS) - 496usize];
    ["Offset of field: enginefuncs_s::pfnSetFatPAS"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetFatPAS) - 500usize];
    ["Offset of field: enginefuncs_s::pfnCheckVisibility"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCheckVisibility) - 504usize];
    ["Offset of field: enginefuncs_s::pfnDeltaSetField"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDeltaSetField) - 508usize];
    ["Offset of field: enginefuncs_s::pfnDeltaUnsetField"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDeltaUnsetField) - 512usize];
    ["Offset of field: enginefuncs_s::pfnDeltaAddEncoder"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDeltaAddEncoder) - 516usize];
    ["Offset of field: enginefuncs_s::pfnGetCurrentPlayer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetCurrentPlayer) - 520usize];
    ["Offset of field: enginefuncs_s::pfnCanSkipPlayer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCanSkipPlayer) - 524usize];
    ["Offset of field: enginefuncs_s::pfnDeltaFindField"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDeltaFindField) - 528usize];
    ["Offset of field: enginefuncs_s::pfnDeltaSetFieldByIndex"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDeltaSetFieldByIndex) - 532usize];
    ["Offset of field: enginefuncs_s::pfnDeltaUnsetFieldByIndex"]
        [::std::mem::offset_of!(enginefuncs_s, pfnDeltaUnsetFieldByIndex) - 536usize];
    ["Offset of field: enginefuncs_s::pfnSetGroupMask"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSetGroupMask) - 540usize];
    ["Offset of field: enginefuncs_s::pfnCreateInstancedBaseline"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCreateInstancedBaseline) - 544usize];
    ["Offset of field: enginefuncs_s::pfnCvar_DirectSet"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCvar_DirectSet) - 548usize];
    ["Offset of field: enginefuncs_s::pfnForceUnmodified"]
        [::std::mem::offset_of!(enginefuncs_s, pfnForceUnmodified) - 552usize];
    ["Offset of field: enginefuncs_s::pfnGetPlayerStats"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetPlayerStats) - 556usize];
    ["Offset of field: enginefuncs_s::pfnAddServerCommand"]
        [::std::mem::offset_of!(enginefuncs_s, pfnAddServerCommand) - 560usize];
    ["Offset of field: enginefuncs_s::pfnVoice_GetClientListening"]
        [::std::mem::offset_of!(enginefuncs_s, pfnVoice_GetClientListening) - 564usize];
    ["Offset of field: enginefuncs_s::pfnVoice_SetClientListening"]
        [::std::mem::offset_of!(enginefuncs_s, pfnVoice_SetClientListening) - 568usize];
    ["Offset of field: enginefuncs_s::pfnGetPlayerAuthId"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetPlayerAuthId) - 572usize];
    ["Offset of field: enginefuncs_s::pfnSequenceGet"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSequenceGet) - 576usize];
    ["Offset of field: enginefuncs_s::pfnSequencePickSentence"]
        [::std::mem::offset_of!(enginefuncs_s, pfnSequencePickSentence) - 580usize];
    ["Offset of field: enginefuncs_s::pfnGetFileSize"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetFileSize) - 584usize];
    ["Offset of field: enginefuncs_s::pfnGetApproxWavePlayLen"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetApproxWavePlayLen) - 588usize];
    ["Offset of field: enginefuncs_s::pfnIsCareerMatch"]
        [::std::mem::offset_of!(enginefuncs_s, pfnIsCareerMatch) - 592usize];
    ["Offset of field: enginefuncs_s::pfnGetLocalizedStringLength"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetLocalizedStringLength) - 596usize];
    ["Offset of field: enginefuncs_s::pfnRegisterTutorMessageShown"]
        [::std::mem::offset_of!(enginefuncs_s, pfnRegisterTutorMessageShown) - 600usize];
    ["Offset of field: enginefuncs_s::pfnGetTimesTutorMessageShown"]
        [::std::mem::offset_of!(enginefuncs_s, pfnGetTimesTutorMessageShown) - 604usize];
    ["Offset of field: enginefuncs_s::pfnProcessTutorMessageDecayBuffer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnProcessTutorMessageDecayBuffer) - 608usize];
    ["Offset of field: enginefuncs_s::pfnConstructTutorMessageDecayBuffer"]
        [::std::mem::offset_of!(enginefuncs_s, pfnConstructTutorMessageDecayBuffer) - 612usize];
    ["Offset of field: enginefuncs_s::pfnResetTutorMessageDecayData"]
        [::std::mem::offset_of!(enginefuncs_s, pfnResetTutorMessageDecayData) - 616usize];
    ["Offset of field: enginefuncs_s::pfnQueryClientCvarValue"]
        [::std::mem::offset_of!(enginefuncs_s, pfnQueryClientCvarValue) - 620usize];
    ["Offset of field: enginefuncs_s::pfnQueryClientCvarValue2"]
        [::std::mem::offset_of!(enginefuncs_s, pfnQueryClientCvarValue2) - 624usize];
    ["Offset of field: enginefuncs_s::pfnCheckParm"]
        [::std::mem::offset_of!(enginefuncs_s, pfnCheckParm) - 628usize];
};
pub type enginefuncs_t = enginefuncs_s;
pub const PLUG_LOADTIME_PT_NEVER: PLUG_LOADTIME = 0;
pub const PLUG_LOADTIME_PT_STARTUP: PLUG_LOADTIME = 1;
pub const PLUG_LOADTIME_PT_CHANGELEVEL: PLUG_LOADTIME = 2;
pub const PLUG_LOADTIME_PT_ANYTIME: PLUG_LOADTIME = 3;
pub const PLUG_LOADTIME_PT_ANYPAUSE: PLUG_LOADTIME = 4;
pub type PLUG_LOADTIME = ::std::os::raw::c_int;
pub const PL_UNLOAD_REASON_PNL_NULL: PL_UNLOAD_REASON = 0;
pub const PL_UNLOAD_REASON_PNL_INI_DELETED: PL_UNLOAD_REASON = 1;
pub const PL_UNLOAD_REASON_PNL_FILE_NEWER: PL_UNLOAD_REASON = 2;
pub const PL_UNLOAD_REASON_PNL_COMMAND: PL_UNLOAD_REASON = 3;
pub const PL_UNLOAD_REASON_PNL_CMD_FORCED: PL_UNLOAD_REASON = 4;
pub const PL_UNLOAD_REASON_PNL_DELAYED: PL_UNLOAD_REASON = 5;
pub const PL_UNLOAD_REASON_PNL_PLUGIN: PL_UNLOAD_REASON = 6;
pub const PL_UNLOAD_REASON_PNL_PLG_FORCED: PL_UNLOAD_REASON = 7;
pub const PL_UNLOAD_REASON_PNL_RELOAD: PL_UNLOAD_REASON = 8;
pub type PL_UNLOAD_REASON = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_info_t {
    pub ifvers: *const ::std::os::raw::c_char,
    pub name: *const ::std::os::raw::c_char,
    pub version: *const ::std::os::raw::c_char,
    pub date: *const ::std::os::raw::c_char,
    pub author: *const ::std::os::raw::c_char,
    pub url: *const ::std::os::raw::c_char,
    pub logtag: *const ::std::os::raw::c_char,
    pub loadable: PLUG_LOADTIME,
    pub unloadable: PLUG_LOADTIME,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_info_t"][::std::mem::size_of::<plugin_info_t>() - 36usize];
    ["Alignment of plugin_info_t"][::std::mem::align_of::<plugin_info_t>() - 4usize];
    ["Offset of field: plugin_info_t::ifvers"]
        [::std::mem::offset_of!(plugin_info_t, ifvers) - 0usize];
    ["Offset of field: plugin_info_t::name"][::std::mem::offset_of!(plugin_info_t, name) - 4usize];
    ["Offset of field: plugin_info_t::version"]
        [::std::mem::offset_of!(plugin_info_t, version) - 8usize];
    ["Offset of field: plugin_info_t::date"][::std::mem::offset_of!(plugin_info_t, date) - 12usize];
    ["Offset of field: plugin_info_t::author"]
        [::std::mem::offset_of!(plugin_info_t, author) - 16usize];
    ["Offset of field: plugin_info_t::url"][::std::mem::offset_of!(plugin_info_t, url) - 20usize];
    ["Offset of field: plugin_info_t::logtag"]
        [::std::mem::offset_of!(plugin_info_t, logtag) - 24usize];
    ["Offset of field: plugin_info_t::loadable"]
        [::std::mem::offset_of!(plugin_info_t, loadable) - 28usize];
    ["Offset of field: plugin_info_t::unloadable"]
        [::std::mem::offset_of!(plugin_info_t, unloadable) - 32usize];
};
pub type plid_t = *mut plugin_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hudtextparms_s {
    pub x: f32,
    pub y: f32,
    pub effect: ::std::os::raw::c_int,
    pub r1: byte,
    pub g1: byte,
    pub b1: byte,
    pub a1: byte,
    pub r2: byte,
    pub g2: byte,
    pub b2: byte,
    pub a2: byte,
    pub fadeinTime: f32,
    pub fadeoutTime: f32,
    pub holdTime: f32,
    pub fxTime: f32,
    pub channel: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of hudtextparms_s"][::std::mem::size_of::<hudtextparms_s>() - 40usize];
    ["Alignment of hudtextparms_s"][::std::mem::align_of::<hudtextparms_s>() - 4usize];
    ["Offset of field: hudtextparms_s::x"][::std::mem::offset_of!(hudtextparms_s, x) - 0usize];
    ["Offset of field: hudtextparms_s::y"][::std::mem::offset_of!(hudtextparms_s, y) - 4usize];
    ["Offset of field: hudtextparms_s::effect"]
        [::std::mem::offset_of!(hudtextparms_s, effect) - 8usize];
    ["Offset of field: hudtextparms_s::r1"][::std::mem::offset_of!(hudtextparms_s, r1) - 12usize];
    ["Offset of field: hudtextparms_s::g1"][::std::mem::offset_of!(hudtextparms_s, g1) - 13usize];
    ["Offset of field: hudtextparms_s::b1"][::std::mem::offset_of!(hudtextparms_s, b1) - 14usize];
    ["Offset of field: hudtextparms_s::a1"][::std::mem::offset_of!(hudtextparms_s, a1) - 15usize];
    ["Offset of field: hudtextparms_s::r2"][::std::mem::offset_of!(hudtextparms_s, r2) - 16usize];
    ["Offset of field: hudtextparms_s::g2"][::std::mem::offset_of!(hudtextparms_s, g2) - 17usize];
    ["Offset of field: hudtextparms_s::b2"][::std::mem::offset_of!(hudtextparms_s, b2) - 18usize];
    ["Offset of field: hudtextparms_s::a2"][::std::mem::offset_of!(hudtextparms_s, a2) - 19usize];
    ["Offset of field: hudtextparms_s::fadeinTime"]
        [::std::mem::offset_of!(hudtextparms_s, fadeinTime) - 20usize];
    ["Offset of field: hudtextparms_s::fadeoutTime"]
        [::std::mem::offset_of!(hudtextparms_s, fadeoutTime) - 24usize];
    ["Offset of field: hudtextparms_s::holdTime"]
        [::std::mem::offset_of!(hudtextparms_s, holdTime) - 28usize];
    ["Offset of field: hudtextparms_s::fxTime"]
        [::std::mem::offset_of!(hudtextparms_s, fxTime) - 32usize];
    ["Offset of field: hudtextparms_s::channel"]
        [::std::mem::offset_of!(hudtextparms_s, channel) - 36usize];
};
pub type hudtextparms_t = hudtextparms_s;
pub type va_list = *mut ::std::os::raw::c_char;
pub const ginfo_t_GINFO_NAME: ginfo_t = 0;
pub const ginfo_t_GINFO_DESC: ginfo_t = 1;
pub const ginfo_t_GINFO_GAMEDIR: ginfo_t = 2;
pub const ginfo_t_GINFO_DLL_FULLPATH: ginfo_t = 3;
pub const ginfo_t_GINFO_DLL_FILENAME: ginfo_t = 4;
pub const ginfo_t_GINFO_REALDLL_FULLPATH: ginfo_t = 5;
pub type ginfo_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct KeyValueData_s {
    pub szClassName: *const ::std::os::raw::c_char,
    pub szKeyName: *const ::std::os::raw::c_char,
    pub szValue: *const ::std::os::raw::c_char,
    pub fHandled: int32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of KeyValueData_s"][::std::mem::size_of::<KeyValueData_s>() - 16usize];
    ["Alignment of KeyValueData_s"][::std::mem::align_of::<KeyValueData_s>() - 4usize];
    ["Offset of field: KeyValueData_s::szClassName"]
        [::std::mem::offset_of!(KeyValueData_s, szClassName) - 0usize];
    ["Offset of field: KeyValueData_s::szKeyName"]
        [::std::mem::offset_of!(KeyValueData_s, szKeyName) - 4usize];
    ["Offset of field: KeyValueData_s::szValue"]
        [::std::mem::offset_of!(KeyValueData_s, szValue) - 8usize];
    ["Offset of field: KeyValueData_s::fHandled"]
        [::std::mem::offset_of!(KeyValueData_s, fHandled) - 12usize];
};
pub type KeyValueData = KeyValueData_s;
pub type SAVERESTOREDATA = saverestore_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ENTITYTABLE {
    pub id: ::std::os::raw::c_int,
    pub pent: *mut edict_t,
    pub location: ::std::os::raw::c_int,
    pub size: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub classname: string_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ENTITYTABLE"][::std::mem::size_of::<ENTITYTABLE>() - 24usize];
    ["Alignment of ENTITYTABLE"][::std::mem::align_of::<ENTITYTABLE>() - 4usize];
    ["Offset of field: ENTITYTABLE::id"][::std::mem::offset_of!(ENTITYTABLE, id) - 0usize];
    ["Offset of field: ENTITYTABLE::pent"][::std::mem::offset_of!(ENTITYTABLE, pent) - 4usize];
    ["Offset of field: ENTITYTABLE::location"]
        [::std::mem::offset_of!(ENTITYTABLE, location) - 8usize];
    ["Offset of field: ENTITYTABLE::size"][::std::mem::offset_of!(ENTITYTABLE, size) - 12usize];
    ["Offset of field: ENTITYTABLE::flags"][::std::mem::offset_of!(ENTITYTABLE, flags) - 16usize];
    ["Offset of field: ENTITYTABLE::classname"]
        [::std::mem::offset_of!(ENTITYTABLE, classname) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LEVELLIST {
    pub mapName: [::std::os::raw::c_char; 32usize],
    pub landmarkName: [::std::os::raw::c_char; 32usize],
    pub pentLandmark: *mut edict_t,
    pub vecLandmarkOrigin: Vector,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LEVELLIST"][::std::mem::size_of::<LEVELLIST>() - 80usize];
    ["Alignment of LEVELLIST"][::std::mem::align_of::<LEVELLIST>() - 4usize];
    ["Offset of field: LEVELLIST::mapName"][::std::mem::offset_of!(LEVELLIST, mapName) - 0usize];
    ["Offset of field: LEVELLIST::landmarkName"]
        [::std::mem::offset_of!(LEVELLIST, landmarkName) - 32usize];
    ["Offset of field: LEVELLIST::pentLandmark"]
        [::std::mem::offset_of!(LEVELLIST, pentLandmark) - 64usize];
    ["Offset of field: LEVELLIST::vecLandmarkOrigin"]
        [::std::mem::offset_of!(LEVELLIST, vecLandmarkOrigin) - 68usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct saverestore_s {
    pub pBaseData: *mut ::std::os::raw::c_char,
    pub pCurrentData: *mut ::std::os::raw::c_char,
    pub size: ::std::os::raw::c_int,
    pub bufferSize: ::std::os::raw::c_int,
    pub tokenSize: ::std::os::raw::c_int,
    pub tokenCount: ::std::os::raw::c_int,
    pub pTokens: *mut *mut ::std::os::raw::c_char,
    pub currentIndex: ::std::os::raw::c_int,
    pub tableCount: ::std::os::raw::c_int,
    pub connectionCount: ::std::os::raw::c_int,
    pub pTable: *mut ENTITYTABLE,
    pub levelList: [LEVELLIST; 16usize],
    pub fUseLandmark: ::std::os::raw::c_int,
    pub szLandmarkName: [::std::os::raw::c_char; 20usize],
    pub vecLandmarkOffset: Vector,
    pub time: f32,
    pub szCurrentMapName: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of saverestore_s"][::std::mem::size_of::<saverestore_s>() - 1396usize];
    ["Alignment of saverestore_s"][::std::mem::align_of::<saverestore_s>() - 4usize];
    ["Offset of field: saverestore_s::pBaseData"]
        [::std::mem::offset_of!(saverestore_s, pBaseData) - 0usize];
    ["Offset of field: saverestore_s::pCurrentData"]
        [::std::mem::offset_of!(saverestore_s, pCurrentData) - 4usize];
    ["Offset of field: saverestore_s::size"][::std::mem::offset_of!(saverestore_s, size) - 8usize];
    ["Offset of field: saverestore_s::bufferSize"]
        [::std::mem::offset_of!(saverestore_s, bufferSize) - 12usize];
    ["Offset of field: saverestore_s::tokenSize"]
        [::std::mem::offset_of!(saverestore_s, tokenSize) - 16usize];
    ["Offset of field: saverestore_s::tokenCount"]
        [::std::mem::offset_of!(saverestore_s, tokenCount) - 20usize];
    ["Offset of field: saverestore_s::pTokens"]
        [::std::mem::offset_of!(saverestore_s, pTokens) - 24usize];
    ["Offset of field: saverestore_s::currentIndex"]
        [::std::mem::offset_of!(saverestore_s, currentIndex) - 28usize];
    ["Offset of field: saverestore_s::tableCount"]
        [::std::mem::offset_of!(saverestore_s, tableCount) - 32usize];
    ["Offset of field: saverestore_s::connectionCount"]
        [::std::mem::offset_of!(saverestore_s, connectionCount) - 36usize];
    ["Offset of field: saverestore_s::pTable"]
        [::std::mem::offset_of!(saverestore_s, pTable) - 40usize];
    ["Offset of field: saverestore_s::levelList"]
        [::std::mem::offset_of!(saverestore_s, levelList) - 44usize];
    ["Offset of field: saverestore_s::fUseLandmark"]
        [::std::mem::offset_of!(saverestore_s, fUseLandmark) - 1324usize];
    ["Offset of field: saverestore_s::szLandmarkName"]
        [::std::mem::offset_of!(saverestore_s, szLandmarkName) - 1328usize];
    ["Offset of field: saverestore_s::vecLandmarkOffset"]
        [::std::mem::offset_of!(saverestore_s, vecLandmarkOffset) - 1348usize];
    ["Offset of field: saverestore_s::time"]
        [::std::mem::offset_of!(saverestore_s, time) - 1360usize];
    ["Offset of field: saverestore_s::szCurrentMapName"]
        [::std::mem::offset_of!(saverestore_s, szCurrentMapName) - 1364usize];
};
pub const _fieldtypes_FIELD_FLOAT: _fieldtypes = 0;
pub const _fieldtypes_FIELD_STRING: _fieldtypes = 1;
pub const _fieldtypes_FIELD_ENTITY: _fieldtypes = 2;
pub const _fieldtypes_FIELD_CLASSPTR: _fieldtypes = 3;
pub const _fieldtypes_FIELD_EHANDLE: _fieldtypes = 4;
pub const _fieldtypes_FIELD_EVARS: _fieldtypes = 5;
pub const _fieldtypes_FIELD_EDICT: _fieldtypes = 6;
pub const _fieldtypes_FIELD_VECTOR: _fieldtypes = 7;
pub const _fieldtypes_FIELD_POSITION_VECTOR: _fieldtypes = 8;
pub const _fieldtypes_FIELD_POINTER: _fieldtypes = 9;
pub const _fieldtypes_FIELD_INTEGER: _fieldtypes = 10;
pub const _fieldtypes_FIELD_FUNCTION: _fieldtypes = 11;
pub const _fieldtypes_FIELD_BOOLEAN: _fieldtypes = 12;
pub const _fieldtypes_FIELD_SHORT: _fieldtypes = 13;
pub const _fieldtypes_FIELD_CHARACTER: _fieldtypes = 14;
pub const _fieldtypes_FIELD_TIME: _fieldtypes = 15;
pub const _fieldtypes_FIELD_MODELNAME: _fieldtypes = 16;
pub const _fieldtypes_FIELD_SOUNDNAME: _fieldtypes = 17;
pub const _fieldtypes_FIELD_TYPECOUNT: _fieldtypes = 18;
pub type _fieldtypes = ::std::os::raw::c_int;
pub use self::_fieldtypes as FIELDTYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TYPEDESCRIPTION {
    pub fieldType: FIELDTYPE,
    pub fieldName: *const ::std::os::raw::c_char,
    pub fieldOffset: ::std::os::raw::c_int,
    pub fieldSize: ::std::os::raw::c_short,
    pub flags: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of TYPEDESCRIPTION"][::std::mem::size_of::<TYPEDESCRIPTION>() - 16usize];
    ["Alignment of TYPEDESCRIPTION"][::std::mem::align_of::<TYPEDESCRIPTION>() - 4usize];
    ["Offset of field: TYPEDESCRIPTION::fieldType"]
        [::std::mem::offset_of!(TYPEDESCRIPTION, fieldType) - 0usize];
    ["Offset of field: TYPEDESCRIPTION::fieldName"]
        [::std::mem::offset_of!(TYPEDESCRIPTION, fieldName) - 4usize];
    ["Offset of field: TYPEDESCRIPTION::fieldOffset"]
        [::std::mem::offset_of!(TYPEDESCRIPTION, fieldOffset) - 8usize];
    ["Offset of field: TYPEDESCRIPTION::fieldSize"]
        [::std::mem::offset_of!(TYPEDESCRIPTION, fieldSize) - 12usize];
    ["Offset of field: TYPEDESCRIPTION::flags"]
        [::std::mem::offset_of!(TYPEDESCRIPTION, flags) - 14usize];
};
pub const resourcetype_t_t_sound: resourcetype_t = 0;
pub const resourcetype_t_t_skin: resourcetype_t = 1;
pub const resourcetype_t_t_model: resourcetype_t = 2;
pub const resourcetype_t_t_decal: resourcetype_t = 3;
pub const resourcetype_t_t_generic: resourcetype_t = 4;
pub const resourcetype_t_t_eventscript: resourcetype_t = 5;
pub const resourcetype_t_t_world: resourcetype_t = 6;
pub type resourcetype_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct resource_s {
    pub szFileName: [::std::os::raw::c_char; 64usize],
    pub type_: resourcetype_t,
    pub nIndex: ::std::os::raw::c_int,
    pub nDownloadSize: ::std::os::raw::c_int,
    pub ucFlags: ::std::os::raw::c_uchar,
    pub rgucMD5_hash: [::std::os::raw::c_uchar; 16usize],
    pub playernum: ::std::os::raw::c_uchar,
    pub rguc_reserved: [::std::os::raw::c_uchar; 32usize],
    pub pNext: *mut resource_s,
    pub pPrev: *mut resource_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of resource_s"][::std::mem::size_of::<resource_s>() - 136usize];
    ["Alignment of resource_s"][::std::mem::align_of::<resource_s>() - 4usize];
    ["Offset of field: resource_s::szFileName"]
        [::std::mem::offset_of!(resource_s, szFileName) - 0usize];
    ["Offset of field: resource_s::type_"][::std::mem::offset_of!(resource_s, type_) - 64usize];
    ["Offset of field: resource_s::nIndex"][::std::mem::offset_of!(resource_s, nIndex) - 68usize];
    ["Offset of field: resource_s::nDownloadSize"]
        [::std::mem::offset_of!(resource_s, nDownloadSize) - 72usize];
    ["Offset of field: resource_s::ucFlags"][::std::mem::offset_of!(resource_s, ucFlags) - 76usize];
    ["Offset of field: resource_s::rgucMD5_hash"]
        [::std::mem::offset_of!(resource_s, rgucMD5_hash) - 77usize];
    ["Offset of field: resource_s::playernum"]
        [::std::mem::offset_of!(resource_s, playernum) - 93usize];
    ["Offset of field: resource_s::rguc_reserved"]
        [::std::mem::offset_of!(resource_s, rguc_reserved) - 94usize];
    ["Offset of field: resource_s::pNext"][::std::mem::offset_of!(resource_s, pNext) - 128usize];
    ["Offset of field: resource_s::pPrev"][::std::mem::offset_of!(resource_s, pPrev) - 132usize];
};
pub type resource_t = resource_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct customization_s {
    pub bInUse: qboolean,
    pub resource: resource_t,
    pub bTranslated: qboolean,
    pub nUserData1: ::std::os::raw::c_int,
    pub nUserData2: ::std::os::raw::c_int,
    pub pInfo: *mut ::std::os::raw::c_void,
    pub pBuffer: *mut ::std::os::raw::c_void,
    pub pNext: *mut customization_s,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of customization_s"][::std::mem::size_of::<customization_s>() - 164usize];
    ["Alignment of customization_s"][::std::mem::align_of::<customization_s>() - 4usize];
    ["Offset of field: customization_s::bInUse"]
        [::std::mem::offset_of!(customization_s, bInUse) - 0usize];
    ["Offset of field: customization_s::resource"]
        [::std::mem::offset_of!(customization_s, resource) - 4usize];
    ["Offset of field: customization_s::bTranslated"]
        [::std::mem::offset_of!(customization_s, bTranslated) - 140usize];
    ["Offset of field: customization_s::nUserData1"]
        [::std::mem::offset_of!(customization_s, nUserData1) - 144usize];
    ["Offset of field: customization_s::nUserData2"]
        [::std::mem::offset_of!(customization_s, nUserData2) - 148usize];
    ["Offset of field: customization_s::pInfo"]
        [::std::mem::offset_of!(customization_s, pInfo) - 152usize];
    ["Offset of field: customization_s::pBuffer"]
        [::std::mem::offset_of!(customization_s, pBuffer) - 156usize];
    ["Offset of field: customization_s::pNext"]
        [::std::mem::offset_of!(customization_s, pNext) - 160usize];
};
pub type customization_t = customization_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DLL_FUNCTIONS {
    pub pfnGameInit: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnSpawn:
        ::std::option::Option<unsafe extern "C" fn(pent: *mut edict_t) -> ::std::os::raw::c_int>,
    pub pfnThink: ::std::option::Option<unsafe extern "C" fn(pent: *mut edict_t)>,
    pub pfnUse: ::std::option::Option<
        unsafe extern "C" fn(pentUsed: *mut edict_t, pentOther: *mut edict_t),
    >,
    pub pfnTouch: ::std::option::Option<
        unsafe extern "C" fn(pentTouched: *mut edict_t, pentOther: *mut edict_t),
    >,
    pub pfnBlocked: ::std::option::Option<
        unsafe extern "C" fn(pentBlocked: *mut edict_t, pentOther: *mut edict_t),
    >,
    pub pfnKeyValue: ::std::option::Option<
        unsafe extern "C" fn(pentKeyvalue: *mut edict_t, pkvd: *mut KeyValueData),
    >,
    pub pfnSave: ::std::option::Option<
        unsafe extern "C" fn(pent: *mut edict_t, pSaveData: *mut SAVERESTOREDATA),
    >,
    pub pfnRestore: ::std::option::Option<
        unsafe extern "C" fn(
            pent: *mut edict_t,
            pSaveData: *mut SAVERESTOREDATA,
            globalEntity: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnSetAbsBox: ::std::option::Option<unsafe extern "C" fn(pent: *mut edict_t)>,
    pub pfnSaveWriteFields: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut SAVERESTOREDATA,
            arg2: *const ::std::os::raw::c_char,
            arg3: *mut ::std::os::raw::c_void,
            arg4: *mut TYPEDESCRIPTION,
            arg5: ::std::os::raw::c_int,
        ),
    >,
    pub pfnSaveReadFields: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut SAVERESTOREDATA,
            arg2: *const ::std::os::raw::c_char,
            arg3: *mut ::std::os::raw::c_void,
            arg4: *mut TYPEDESCRIPTION,
            arg5: ::std::os::raw::c_int,
        ),
    >,
    pub pfnSaveGlobalState: ::std::option::Option<unsafe extern "C" fn(arg1: *mut SAVERESTOREDATA)>,
    pub pfnRestoreGlobalState:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut SAVERESTOREDATA)>,
    pub pfnResetGlobalState: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnClientConnect: ::std::option::Option<
        unsafe extern "C" fn(
            pEntity: *mut edict_t,
            pszName: *const ::std::os::raw::c_char,
            pszAddress: *const ::std::os::raw::c_char,
            szRejectReason: *mut ::std::os::raw::c_char,
        ) -> qboolean,
    >,
    pub pfnClientDisconnect: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnClientKill: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnClientPutInServer: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnClientCommand: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnClientUserInfoChanged: ::std::option::Option<
        unsafe extern "C" fn(pEntity: *mut edict_t, infobuffer: *mut ::std::os::raw::c_char),
    >,
    pub pfnServerActivate: ::std::option::Option<
        unsafe extern "C" fn(
            pEdictList: *mut edict_t,
            edictCount: ::std::os::raw::c_int,
            clientMax: ::std::os::raw::c_int,
        ),
    >,
    pub pfnServerDeactivate: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnPlayerPreThink: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnPlayerPostThink: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnStartFrame: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnParmsNewLevel: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnParmsChangeLevel: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnGetGameDescription:
        ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>,
    pub pfnPlayerCustomization: ::std::option::Option<
        unsafe extern "C" fn(pEntity: *mut edict_t, pCustom: *mut customization_t),
    >,
    pub pfnSpectatorConnect: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnSpectatorDisconnect: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnSpectatorThink: ::std::option::Option<unsafe extern "C" fn(pEntity: *mut edict_t)>,
    pub pfnSys_Error:
        ::std::option::Option<unsafe extern "C" fn(error_string: *const ::std::os::raw::c_char)>,
    pub pfnPM_Move:
        ::std::option::Option<unsafe extern "C" fn(ppmove: *mut playermove_s, server: qboolean)>,
    pub pfnPM_Init: ::std::option::Option<unsafe extern "C" fn(ppmove: *mut playermove_s)>,
    pub pfnPM_FindTextureType: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_char,
    >,
    pub pfnSetupVisibility: ::std::option::Option<
        unsafe extern "C" fn(
            pViewEntity: *mut edict_s,
            pClient: *mut edict_s,
            pvs: *mut *mut ::std::os::raw::c_uchar,
            pas: *mut *mut ::std::os::raw::c_uchar,
        ),
    >,
    pub pfnUpdateClientData: ::std::option::Option<
        unsafe extern "C" fn(
            ent: *const edict_s,
            sendweapons: ::std::os::raw::c_int,
            cd: *mut clientdata_s,
        ),
    >,
    pub pfnAddToFullPack: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut entity_state_s,
            e: ::std::os::raw::c_int,
            ent: *mut edict_t,
            host: *mut edict_t,
            hostflags: ::std::os::raw::c_int,
            player: ::std::os::raw::c_int,
            pSet: *mut ::std::os::raw::c_uchar,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnCreateBaseline: ::std::option::Option<
        unsafe extern "C" fn(
            player: ::std::os::raw::c_int,
            eindex: ::std::os::raw::c_int,
            baseline: *mut entity_state_s,
            entity: *mut edict_s,
            playermodelindex: ::std::os::raw::c_int,
            player_mins: Vector,
            player_maxs: Vector,
        ),
    >,
    pub pfnRegisterEncoders: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnGetWeaponData: ::std::option::Option<
        unsafe extern "C" fn(
            player: *mut edict_s,
            info: *mut weapon_data_s,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnCmdStart: ::std::option::Option<
        unsafe extern "C" fn(
            player: *const edict_t,
            cmd: *mut usercmd_s,
            random_seed: ::std::os::raw::c_uint,
        ),
    >,
    pub pfnCmdEnd: ::std::option::Option<unsafe extern "C" fn(player: *const edict_t)>,
    pub pfnConnectionlessPacket: ::std::option::Option<
        unsafe extern "C" fn(
            net_from: *mut netadr_s,
            args: *const ::std::os::raw::c_char,
            response_buffer: *mut ::std::os::raw::c_char,
            response_buffer_size: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnGetHullBounds: ::std::option::Option<
        unsafe extern "C" fn(
            hullnumber: ::std::os::raw::c_int,
            mins: *mut f32,
            maxs: *mut f32,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnCreateInstancedBaselines: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnInconsistentFile: ::std::option::Option<
        unsafe extern "C" fn(
            player: *const edict_s,
            filename: *const ::std::os::raw::c_char,
            disconnect_message: *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnAllowLagCompensation:
        ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DLL_FUNCTIONS"][::std::mem::size_of::<DLL_FUNCTIONS>() - 200usize];
    ["Alignment of DLL_FUNCTIONS"][::std::mem::align_of::<DLL_FUNCTIONS>() - 4usize];
    ["Offset of field: DLL_FUNCTIONS::pfnGameInit"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnGameInit) - 0usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSpawn"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSpawn) - 4usize];
    ["Offset of field: DLL_FUNCTIONS::pfnThink"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnThink) - 8usize];
    ["Offset of field: DLL_FUNCTIONS::pfnUse"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnUse) - 12usize];
    ["Offset of field: DLL_FUNCTIONS::pfnTouch"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnTouch) - 16usize];
    ["Offset of field: DLL_FUNCTIONS::pfnBlocked"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnBlocked) - 20usize];
    ["Offset of field: DLL_FUNCTIONS::pfnKeyValue"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnKeyValue) - 24usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSave"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSave) - 28usize];
    ["Offset of field: DLL_FUNCTIONS::pfnRestore"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnRestore) - 32usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSetAbsBox"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSetAbsBox) - 36usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSaveWriteFields"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSaveWriteFields) - 40usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSaveReadFields"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSaveReadFields) - 44usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSaveGlobalState"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSaveGlobalState) - 48usize];
    ["Offset of field: DLL_FUNCTIONS::pfnRestoreGlobalState"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnRestoreGlobalState) - 52usize];
    ["Offset of field: DLL_FUNCTIONS::pfnResetGlobalState"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnResetGlobalState) - 56usize];
    ["Offset of field: DLL_FUNCTIONS::pfnClientConnect"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnClientConnect) - 60usize];
    ["Offset of field: DLL_FUNCTIONS::pfnClientDisconnect"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnClientDisconnect) - 64usize];
    ["Offset of field: DLL_FUNCTIONS::pfnClientKill"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnClientKill) - 68usize];
    ["Offset of field: DLL_FUNCTIONS::pfnClientPutInServer"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnClientPutInServer) - 72usize];
    ["Offset of field: DLL_FUNCTIONS::pfnClientCommand"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnClientCommand) - 76usize];
    ["Offset of field: DLL_FUNCTIONS::pfnClientUserInfoChanged"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnClientUserInfoChanged) - 80usize];
    ["Offset of field: DLL_FUNCTIONS::pfnServerActivate"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnServerActivate) - 84usize];
    ["Offset of field: DLL_FUNCTIONS::pfnServerDeactivate"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnServerDeactivate) - 88usize];
    ["Offset of field: DLL_FUNCTIONS::pfnPlayerPreThink"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnPlayerPreThink) - 92usize];
    ["Offset of field: DLL_FUNCTIONS::pfnPlayerPostThink"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnPlayerPostThink) - 96usize];
    ["Offset of field: DLL_FUNCTIONS::pfnStartFrame"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnStartFrame) - 100usize];
    ["Offset of field: DLL_FUNCTIONS::pfnParmsNewLevel"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnParmsNewLevel) - 104usize];
    ["Offset of field: DLL_FUNCTIONS::pfnParmsChangeLevel"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnParmsChangeLevel) - 108usize];
    ["Offset of field: DLL_FUNCTIONS::pfnGetGameDescription"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnGetGameDescription) - 112usize];
    ["Offset of field: DLL_FUNCTIONS::pfnPlayerCustomization"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnPlayerCustomization) - 116usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSpectatorConnect"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSpectatorConnect) - 120usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSpectatorDisconnect"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSpectatorDisconnect) - 124usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSpectatorThink"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSpectatorThink) - 128usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSys_Error"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSys_Error) - 132usize];
    ["Offset of field: DLL_FUNCTIONS::pfnPM_Move"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnPM_Move) - 136usize];
    ["Offset of field: DLL_FUNCTIONS::pfnPM_Init"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnPM_Init) - 140usize];
    ["Offset of field: DLL_FUNCTIONS::pfnPM_FindTextureType"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnPM_FindTextureType) - 144usize];
    ["Offset of field: DLL_FUNCTIONS::pfnSetupVisibility"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnSetupVisibility) - 148usize];
    ["Offset of field: DLL_FUNCTIONS::pfnUpdateClientData"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnUpdateClientData) - 152usize];
    ["Offset of field: DLL_FUNCTIONS::pfnAddToFullPack"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnAddToFullPack) - 156usize];
    ["Offset of field: DLL_FUNCTIONS::pfnCreateBaseline"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnCreateBaseline) - 160usize];
    ["Offset of field: DLL_FUNCTIONS::pfnRegisterEncoders"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnRegisterEncoders) - 164usize];
    ["Offset of field: DLL_FUNCTIONS::pfnGetWeaponData"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnGetWeaponData) - 168usize];
    ["Offset of field: DLL_FUNCTIONS::pfnCmdStart"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnCmdStart) - 172usize];
    ["Offset of field: DLL_FUNCTIONS::pfnCmdEnd"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnCmdEnd) - 176usize];
    ["Offset of field: DLL_FUNCTIONS::pfnConnectionlessPacket"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnConnectionlessPacket) - 180usize];
    ["Offset of field: DLL_FUNCTIONS::pfnGetHullBounds"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnGetHullBounds) - 184usize];
    ["Offset of field: DLL_FUNCTIONS::pfnCreateInstancedBaselines"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnCreateInstancedBaselines) - 188usize];
    ["Offset of field: DLL_FUNCTIONS::pfnInconsistentFile"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnInconsistentFile) - 192usize];
    ["Offset of field: DLL_FUNCTIONS::pfnAllowLagCompensation"]
        [::std::mem::offset_of!(DLL_FUNCTIONS, pfnAllowLagCompensation) - 196usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct NEW_DLL_FUNCTIONS {
    pub pfnOnFreeEntPrivateData: ::std::option::Option<unsafe extern "C" fn(pEnt: *mut edict_t)>,
    pub pfnGameShutdown: ::std::option::Option<unsafe extern "C" fn()>,
    pub pfnShouldCollide: ::std::option::Option<
        unsafe extern "C" fn(
            pentTouched: *mut edict_t,
            pentOther: *mut edict_t,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnCvarValue: ::std::option::Option<
        unsafe extern "C" fn(pEnt: *const edict_t, value: *const ::std::os::raw::c_char),
    >,
    pub pfnCvarValue2: ::std::option::Option<
        unsafe extern "C" fn(
            pEnt: *const edict_t,
            requestID: ::std::os::raw::c_int,
            cvarName: *const ::std::os::raw::c_char,
            value: *const ::std::os::raw::c_char,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of NEW_DLL_FUNCTIONS"][::std::mem::size_of::<NEW_DLL_FUNCTIONS>() - 20usize];
    ["Alignment of NEW_DLL_FUNCTIONS"][::std::mem::align_of::<NEW_DLL_FUNCTIONS>() - 4usize];
    ["Offset of field: NEW_DLL_FUNCTIONS::pfnOnFreeEntPrivateData"]
        [::std::mem::offset_of!(NEW_DLL_FUNCTIONS, pfnOnFreeEntPrivateData) - 0usize];
    ["Offset of field: NEW_DLL_FUNCTIONS::pfnGameShutdown"]
        [::std::mem::offset_of!(NEW_DLL_FUNCTIONS, pfnGameShutdown) - 4usize];
    ["Offset of field: NEW_DLL_FUNCTIONS::pfnShouldCollide"]
        [::std::mem::offset_of!(NEW_DLL_FUNCTIONS, pfnShouldCollide) - 8usize];
    ["Offset of field: NEW_DLL_FUNCTIONS::pfnCvarValue"]
        [::std::mem::offset_of!(NEW_DLL_FUNCTIONS, pfnCvarValue) - 12usize];
    ["Offset of field: NEW_DLL_FUNCTIONS::pfnCvarValue2"]
        [::std::mem::offset_of!(NEW_DLL_FUNCTIONS, pfnCvarValue2) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct meta_util_funcs_s {
    pub pfnLogConsole: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, fmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnLogMessage: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, fmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnLogError: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, fmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnLogDeveloper: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, fmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnCenterSay: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, fmt: *const ::std::os::raw::c_char, ...),
    >,
    pub pfnCenterSayParms: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            tparms: hudtextparms_t,
            fmt: *const ::std::os::raw::c_char,
            ...
        ),
    >,
    pub pfnCenterSayVarargs: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            tparms: hudtextparms_t,
            fmt: *const ::std::os::raw::c_char,
            ap: va_list,
        ),
    >,
    pub pfnCallGameEntity: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            entStr: *const ::std::os::raw::c_char,
            pev: *mut entvars_t,
        ) -> qboolean,
    >,
    pub pfnGetUserMsgID: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            msgname: *const ::std::os::raw::c_char,
            size: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnGetUserMsgName: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            msgid: ::std::os::raw::c_int,
            size: *mut ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub pfnGetPluginPath:
        ::std::option::Option<unsafe extern "C" fn(plid: plid_t) -> *const ::std::os::raw::c_char>,
    pub pfnGetGameInfo: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, tag: ginfo_t) -> *const ::std::os::raw::c_char,
    >,
    pub pfnLoadPlugin: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            cmdline: *const ::std::os::raw::c_char,
            now: PLUG_LOADTIME,
            plugin_handle: *mut *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnUnloadPlugin: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            cmdline: *const ::std::os::raw::c_char,
            now: PLUG_LOADTIME,
            reason: PL_UNLOAD_REASON,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnUnloadPluginByHandle: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            plugin_handle: *mut ::std::os::raw::c_void,
            now: PLUG_LOADTIME,
            reason: PL_UNLOAD_REASON,
        ) -> ::std::os::raw::c_int,
    >,
    pub pfnIsQueryingClientCvar: ::std::option::Option<
        unsafe extern "C" fn(plid: plid_t, pEdict: *const edict_t) -> *const ::std::os::raw::c_char,
    >,
    pub pfnMakeRequestId:
        ::std::option::Option<unsafe extern "C" fn(plid: plid_t) -> ::std::os::raw::c_int>,
    pub pfnGetHookTables: ::std::option::Option<
        unsafe extern "C" fn(
            plid: plid_t,
            peng: *mut *mut enginefuncs_t,
            pdll: *mut *mut DLL_FUNCTIONS,
            pnewdll: *mut *mut NEW_DLL_FUNCTIONS,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of meta_util_funcs_s"][::std::mem::size_of::<meta_util_funcs_s>() - 72usize];
    ["Alignment of meta_util_funcs_s"][::std::mem::align_of::<meta_util_funcs_s>() - 4usize];
    ["Offset of field: meta_util_funcs_s::pfnLogConsole"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnLogConsole) - 0usize];
    ["Offset of field: meta_util_funcs_s::pfnLogMessage"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnLogMessage) - 4usize];
    ["Offset of field: meta_util_funcs_s::pfnLogError"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnLogError) - 8usize];
    ["Offset of field: meta_util_funcs_s::pfnLogDeveloper"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnLogDeveloper) - 12usize];
    ["Offset of field: meta_util_funcs_s::pfnCenterSay"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnCenterSay) - 16usize];
    ["Offset of field: meta_util_funcs_s::pfnCenterSayParms"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnCenterSayParms) - 20usize];
    ["Offset of field: meta_util_funcs_s::pfnCenterSayVarargs"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnCenterSayVarargs) - 24usize];
    ["Offset of field: meta_util_funcs_s::pfnCallGameEntity"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnCallGameEntity) - 28usize];
    ["Offset of field: meta_util_funcs_s::pfnGetUserMsgID"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnGetUserMsgID) - 32usize];
    ["Offset of field: meta_util_funcs_s::pfnGetUserMsgName"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnGetUserMsgName) - 36usize];
    ["Offset of field: meta_util_funcs_s::pfnGetPluginPath"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnGetPluginPath) - 40usize];
    ["Offset of field: meta_util_funcs_s::pfnGetGameInfo"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnGetGameInfo) - 44usize];
    ["Offset of field: meta_util_funcs_s::pfnLoadPlugin"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnLoadPlugin) - 48usize];
    ["Offset of field: meta_util_funcs_s::pfnUnloadPlugin"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnUnloadPlugin) - 52usize];
    ["Offset of field: meta_util_funcs_s::pfnUnloadPluginByHandle"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnUnloadPluginByHandle) - 56usize];
    ["Offset of field: meta_util_funcs_s::pfnIsQueryingClientCvar"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnIsQueryingClientCvar) - 60usize];
    ["Offset of field: meta_util_funcs_s::pfnMakeRequestId"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnMakeRequestId) - 64usize];
    ["Offset of field: meta_util_funcs_s::pfnGetHookTables"]
        [::std::mem::offset_of!(meta_util_funcs_s, pfnGetHookTables) - 68usize];
};
pub type mutil_funcs_t = meta_util_funcs_s;
pub type GETENTITYAPI_FN = ::std::option::Option<
    unsafe extern "C" fn(
        pFunctionTable: *mut DLL_FUNCTIONS,
        interfaceVersion: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type GETENTITYAPI2_FN = ::std::option::Option<
    unsafe extern "C" fn(
        pFunctionTable: *mut DLL_FUNCTIONS,
        interfaceVersion: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type GETNEWDLLFUNCTIONS_FN = ::std::option::Option<
    unsafe extern "C" fn(
        pFunctionTable: *mut NEW_DLL_FUNCTIONS,
        interfaceVersion: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type GET_ENGINE_FUNCTIONS_FN = ::std::option::Option<
    unsafe extern "C" fn(
        pengfuncsFromEngine: *mut enginefuncs_t,
        interfaceVersion: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct META_FUNCTIONS {
    pub pfnGetEntityAPI: GETENTITYAPI_FN,
    pub pfnGetEntityAPI_Post: GETENTITYAPI_FN,
    pub pfnGetEntityAPI2: GETENTITYAPI2_FN,
    pub pfnGetEntityAPI2_Post: GETENTITYAPI2_FN,
    pub pfnGetNewDLLFunctions: GETNEWDLLFUNCTIONS_FN,
    pub pfnGetNewDLLFunctions_Post: GETNEWDLLFUNCTIONS_FN,
    pub pfnGetEngineFunctions: GET_ENGINE_FUNCTIONS_FN,
    pub pfnGetEngineFunctions_Post: GET_ENGINE_FUNCTIONS_FN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of META_FUNCTIONS"][::std::mem::size_of::<META_FUNCTIONS>() - 32usize];
    ["Alignment of META_FUNCTIONS"][::std::mem::align_of::<META_FUNCTIONS>() - 4usize];
    ["Offset of field: META_FUNCTIONS::pfnGetEntityAPI"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetEntityAPI) - 0usize];
    ["Offset of field: META_FUNCTIONS::pfnGetEntityAPI_Post"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetEntityAPI_Post) - 4usize];
    ["Offset of field: META_FUNCTIONS::pfnGetEntityAPI2"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetEntityAPI2) - 8usize];
    ["Offset of field: META_FUNCTIONS::pfnGetEntityAPI2_Post"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetEntityAPI2_Post) - 12usize];
    ["Offset of field: META_FUNCTIONS::pfnGetNewDLLFunctions"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetNewDLLFunctions) - 16usize];
    ["Offset of field: META_FUNCTIONS::pfnGetNewDLLFunctions_Post"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetNewDLLFunctions_Post) - 20usize];
    ["Offset of field: META_FUNCTIONS::pfnGetEngineFunctions"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetEngineFunctions) - 24usize];
    ["Offset of field: META_FUNCTIONS::pfnGetEngineFunctions_Post"]
        [::std::mem::offset_of!(META_FUNCTIONS, pfnGetEngineFunctions_Post) - 28usize];
};
pub const META_RES_MRES_UNSET: META_RES = 0;
pub const META_RES_MRES_IGNORED: META_RES = 1;
pub const META_RES_MRES_HANDLED: META_RES = 2;
pub const META_RES_MRES_OVERRIDE: META_RES = 3;
pub const META_RES_MRES_SUPERCEDE: META_RES = 4;
pub type META_RES = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct meta_globals_s {
    pub mres: META_RES,
    pub prev_mres: META_RES,
    pub status: META_RES,
    pub orig_ret: *mut ::std::os::raw::c_void,
    pub override_ret: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of meta_globals_s"][::std::mem::size_of::<meta_globals_s>() - 20usize];
    ["Alignment of meta_globals_s"][::std::mem::align_of::<meta_globals_s>() - 4usize];
    ["Offset of field: meta_globals_s::mres"]
        [::std::mem::offset_of!(meta_globals_s, mres) - 0usize];
    ["Offset of field: meta_globals_s::prev_mres"]
        [::std::mem::offset_of!(meta_globals_s, prev_mres) - 4usize];
    ["Offset of field: meta_globals_s::status"]
        [::std::mem::offset_of!(meta_globals_s, status) - 8usize];
    ["Offset of field: meta_globals_s::orig_ret"]
        [::std::mem::offset_of!(meta_globals_s, orig_ret) - 12usize];
    ["Offset of field: meta_globals_s::override_ret"]
        [::std::mem::offset_of!(meta_globals_s, override_ret) - 16usize];
};
pub type meta_globals_t = meta_globals_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct gamedll_funcs_t {
    pub dllapi_table: *mut DLL_FUNCTIONS,
    pub newapi_table: *mut NEW_DLL_FUNCTIONS,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of gamedll_funcs_t"][::std::mem::size_of::<gamedll_funcs_t>() - 8usize];
    ["Alignment of gamedll_funcs_t"][::std::mem::align_of::<gamedll_funcs_t>() - 4usize];
    ["Offset of field: gamedll_funcs_t::dllapi_table"]
        [::std::mem::offset_of!(gamedll_funcs_t, dllapi_table) - 0usize];
    ["Offset of field: gamedll_funcs_t::newapi_table"]
        [::std::mem::offset_of!(gamedll_funcs_t, newapi_table) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct delta_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct entity_state_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct playermove_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct clientdata_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct weapon_data_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct usercmd_s {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netadr_s {
    _unused: [u8; 0],
}
